[{"name":"Sony Mavica FD-71","amazon_reviews":["Now I finally have a camera that takes floppies","Now I finally have a camera that takes floppies"]},{"name":"Olympus D-620L (C1400XL)","amazon_reviews":["I bought my Olympus D-620L four years ago, in November of 1999, just about the time that digital cameras were beginning to attract the interest of novice camera users.  My camera has been a workhorse since then, helping me capture excellent photos for use on Ebay as well as in some brochures I've produced for small businesses.  My friends have newer and fancier models, but my photos turn out as well as theirs do, and seem far easier to shoot.  Unfortunately, last week my beloved old D-620L developed a problem when using the built-in flash.  The flash doesn't flash until a second or so after the photo has been taken, so unless I use the camera outdoors or with good indoor lighting, the photos are too dark to use.  I returned the camera to Olympus for repair, knowing that an out-of-warranty fix was probably going to be pricey.  Well, I just got the estimate to fix it:  $262.00.  I'm guessing that's a standard fee that Olympus charges for any repair because before I mailed in the camera, someone I spoke to in the Olympus customer service department said that I'd probably be looking at \"$262.00 to fix any problem.\"  Still, I sent the camera to Olympus, hoping that the repair would be less than the estimate.  It wasn't, so I'm having the camera returned without having the repair done.  It doesn't make sense to put that kind of money into a camera that's 4 years old, even though I don't want to buy a new camera at this point.  So, my old D-620L will be used for outdoor shots only until I make the move to buy another digital camera.  I don't need a 3, 4, or 5 megapixel camera, movie capabilities, or many of the other bells and whistles that are standard on most digital cameras today.  But I do want a camera that looks and feels like a camera, not a toy, and one that has a decent viewfinder and zoom.  Until that perfect camera jumps up and grabs me, I'll be making do with my Olympus D-620L.  By the way, the only reason I rated this camera with 4 stars instead of 5 is because of the steep cost of repairs after the camera is out of warranty.  To be fair, however, the sky-high repairs on an out-of-warranty camera are probably a universal problem.  Canon has a similar policy; my fairly new, barely out-of-date Canon Z155 died on me not long ago, and the repair estimate on that thing was MORE than the cost of the camera when purchased new.  I ditched the camera.","This camera is one of the best digital cameras for Magazine quality work.  It is an SLR camera (you look through the lens).  It has aperature and shutter-speed settings and USB and Serial attachments.  You have three different quality (Standard, High, Super High) settings as well as date stamp possiblities.  Great to focus and zoom!  Looks professional too.","This was a nice camera when it was first released, but what's with the PRICE?!?! Tell me it's a typo!<br />For that price I'd rather pick up a Minolta Dimage 7i!!<br />JMHO,<br />StMute","Pick this camera up and you'll be reminded of the heft of older, metal-bodied 35mm film cameras. It seems that the SLR setup has added a significant weight burden, while supposedly lending better optics to the camera. In this price range, most digital cameras now offer potent optical zoom lenses (7-10x not uncommon), while the 620 makes do with a marginal 3:1 setup. In addition, while most offer resolutions in the 3+ megapixel range, the 620 is a 2.1 megapixel camera. While there are some user-controlled features that make it fun to use, it is still pretty much a computer chip controlled digicam with a particularly slow autofocus system. In this price range, I'll take the Olympus 700 anyday!","I remember when my office bought this camera back in 1998 for three times the price.  I thought it was a great camera then, but even now it's fabulous.  I love being able to focus in on small objects or use the wide  angle to get the big picture.  And with the extra 8 megs of smart media,  it's like carting around three more rolls of film.  The batteries only take  three hours to recharge and they last.  All in all, it's everything I  wanted and more.","Sure, it has great optics.  And you can't beat a SLR camera for composition.  The smartmedia interfaces [pcmcia or usb] are blazingly fast.  Ample resolution to print a 4x6 photo.<br />Think of it as the digital  equivalent to a Polaroid camera.  Instant review of your shots [essential  at events such as reunions!] and enough features to keep you interested  until it comes time to get the next great thing.<br />As with any other  piece of technology, I expect it to be rugged -- it is.  The zoom is WITHIN  the camera, not outside, so you can't hurt its gears by dropping it.  It  has screw threads up front and therefore will take common accessories.<br />It is as easy to use, it handles as well and it works just like their IS  line of film cameras.<br />This is the first digital camera I've felt  confident enough in to replace film for most social situations.","This is my first digital camera and I am very impressed!  The picture quality is incredible.  I compared images online with several more expensive models and the D620 came out on top.  The camera is easy to use  and fast, only a tiny delay between shots.  I do wish the low-light  capability was better.  You can't focus or shoot below a certain light  level.  The other positives far outweigh this shortcoming however.","If you're considering buying a digital camera for the first time, consider the following three items as necessary: 1. optical zoom 2. built-in flash (as in light, not memory) 3. highest possible resolution<br />This camera has two of the three. Technology is moving so rapidly that Olympus has  introduced two newer models (D-2000 and D-2400) that are higher resolution.  I guess that this will just be like my PC -- I replace the camera every  three years.<br />It is easy to handle and the software that comes with it is  good.  Memory cards are inexpensive to purchase.  There's an interesting  accessory, a 1.45X lens attachment, that gives better optical zoom  characteristics.<br />I recently had my Olympus D-610 smooshed by a horse  trailer and replaced it with the D-620.  There's no real differences.<br />The  only negative: other reviewers are correct about there being NO WAY to  force the flash to go off at night.  Recently I had to turn on the patio  light just to get enough light for the flash to work.","I have had them all, 35mm, point and shoot, hasselblad and all the lenses.  I am not ready to give the rest up, they all have their place, but the Olympus and the smart media with a floppy disk adapter have taken me to a  new level.  It all works great, probably better in day than night, but  great.","I bought my Olympus D-620L four years ago, in November of 1999, just about the time that digital cameras were beginning to attract the interest of novice camera users.  My camera has been a workhorse since then, helping me capture excellent photos for use on Ebay as well as in some brochures I've produced for small businesses.  My friends have newer and fancier models, but my photos turn out as well as theirs do, and seem far easier to shoot.  Unfortunately, last week my beloved old D-620L developed a problem when using the built-in flash.  The flash doesn't flash until a second or so after the photo has been taken, so unless I use the camera outdoors or with good indoor lighting, the photos are too dark to use.  I returned the camera to Olympus for repair, knowing that an out-of-warranty fix was probably going to be pricey.  Well, I just got the estimate to fix it:  $262.00.  I'm guessing that's a standard fee that Olympus charges for any repair because before I mailed in the camera, someone I spoke to in the Olympus customer service department said that I'd probably be looking at \"$262.00 to fix any problem.\"  Still, I sent the camera to Olympus, hoping that the repair would be less than the estimate.  It wasn't, so I'm having the camera returned without having the repair done.  It doesn't make sense to put that kind of money into a camera that's 4 years old, even though I don't want to buy a new camera at this point.  So, my old D-620L will be used for outdoor shots only until I make the move to buy another digital camera.  I don't need a 3, 4, or 5 megapixel camera, movie capabilities, or many of the other bells and whistles that are standard on most digital cameras today.  But I do want a camera that looks and feels like a camera, not a toy, and one that has a decent viewfinder and zoom.  Until that perfect camera jumps up and grabs me, I'll be making do with my Olympus D-620L.  By the way, the only reason I rated this camera with 4 stars instead of 5 is because of the steep cost of repairs after the camera is out of warranty.  To be fair, however, the sky-high repairs on an out-of-warranty camera are probably a universal problem.  Canon has a similar policy; my fairly new, barely out-of-date Canon Z155 died on me not long ago, and the repair estimate on that thing was MORE than the cost of the camera when purchased new.  I ditched the camera.","This camera is one of the best digital cameras for Magazine quality work.  It is an SLR camera (you look through the lens).  It has aperature and shutter-speed settings and USB and Serial attachments.  You have three different quality (Standard, High, Super High) settings as well as date stamp possiblities.  Great to focus and zoom!  Looks professional too.","This was a nice camera when it was first released, but what's with the PRICE?!?! Tell me it's a typo!<br />For that price I'd rather pick up a Minolta Dimage 7i!!<br />JMHO,<br />StMute","Pick this camera up and you'll be reminded of the heft of older, metal-bodied 35mm film cameras. It seems that the SLR setup has added a significant weight burden, while supposedly lending better optics to the camera. In this price range, most digital cameras now offer potent optical zoom lenses (7-10x not uncommon), while the 620 makes do with a marginal 3:1 setup. In addition, while most offer resolutions in the 3+ megapixel range, the 620 is a 2.1 megapixel camera. While there are some user-controlled features that make it fun to use, it is still pretty much a computer chip controlled digicam with a particularly slow autofocus system. In this price range, I'll take the Olympus 700 anyday!","I remember when my office bought this camera back in 1998 for three times the price.  I thought it was a great camera then, but even now it's fabulous.  I love being able to focus in on small objects or use the wide  angle to get the big picture.  And with the extra 8 megs of smart media,  it's like carting around three more rolls of film.  The batteries only take  three hours to recharge and they last.  All in all, it's everything I  wanted and more.","Sure, it has great optics.  And you can't beat a SLR camera for composition.  The smartmedia interfaces [pcmcia or usb] are blazingly fast.  Ample resolution to print a 4x6 photo.<br />Think of it as the digital  equivalent to a Polaroid camera.  Instant review of your shots [essential  at events such as reunions!] and enough features to keep you interested  until it comes time to get the next great thing.<br />As with any other  piece of technology, I expect it to be rugged -- it is.  The zoom is WITHIN  the camera, not outside, so you can't hurt its gears by dropping it.  It  has screw threads up front and therefore will take common accessories.<br />It is as easy to use, it handles as well and it works just like their IS  line of film cameras.<br />This is the first digital camera I've felt  confident enough in to replace film for most social situations.","This is my first digital camera and I am very impressed!  The picture quality is incredible.  I compared images online with several more expensive models and the D620 came out on top.  The camera is easy to use  and fast, only a tiny delay between shots.  I do wish the low-light  capability was better.  You can't focus or shoot below a certain light  level.  The other positives far outweigh this shortcoming however.","If you're considering buying a digital camera for the first time, consider the following three items as necessary: 1. optical zoom 2. built-in flash (as in light, not memory) 3. highest possible resolution<br />This camera has two of the three. Technology is moving so rapidly that Olympus has  introduced two newer models (D-2000 and D-2400) that are higher resolution.  I guess that this will just be like my PC -- I replace the camera every  three years.<br />It is easy to handle and the software that comes with it is  good.  Memory cards are inexpensive to purchase.  There's an interesting  accessory, a 1.45X lens attachment, that gives better optical zoom  characteristics.<br />I recently had my Olympus D-610 smooshed by a horse  trailer and replaced it with the D-620.  There's no real differences.<br />The  only negative: other reviewers are correct about there being NO WAY to  force the flash to go off at night.  Recently I had to turn on the patio  light just to get enough light for the flash to work.","I have had them all, 35mm, point and shoot, hasselblad and all the lenses.  I am not ready to give the rest up, they all have their place, but the Olympus and the smart media with a floppy disk adapter have taken me to a  new level.  It all works great, probably better in day than night, but  great.","I have had my Olympus just over a month now and after taking litteraly hundreds of pictures, I have had no problems at all. I did try running the camera off of AA batteries and was not impressed with the life span,  however, the camera continues to perform like a champ.","PROS:<br />Overall, I love my 620L.  The images it generates are excellent and you have the choice of three different quality settings.  Spare NiMH batteries are a must, but that is true with any digital camera, especially  one with a flash.  We have had prints made from pictures taken with this  camera and they were great.<br />CONS:<br />Difficult to take night shots or low  light shots.  The camera is equivalent to a 100 ASA film so if you are  planning on taking low light shots, this isn't the camera for you.","Bought the camera in Dec 1998 and, after several months of use, have found two problems.  The camera will not allow you take night photographs even with the built in shutter adjustments; the shutter will simply not take the  picture and allow you to decide whether it is useable or not. Secondly, the  plug in cable from the camera to the PC is very sensitive (am on my third  one)and at times I have to hold the input plug on the camera firmly during  the download or it will stop the transfer. The upside...great pics and this  camera takes standard close-up, telephoto or wide-angle lenses.","I bought this camera in March of 1999. I absolutely love it. I had planned on keeping my Canon 35MM figuring that there was no way that the Digital camera could compare in quality. Boy was I wrong! It is so easy to use,  very solid and looks very much like a 35mm camera. I would most definately  buy this one again!"]},{"name":"Olympus D-400 Zoom (C900Z)","amazon_reviews":["The Olympus D-400 is an excellent Digi-cam for the money. But beware of the Bloodhound Virus which came with the included FlashPath Floppy Adapter. Luckily, Norton's Anti-Virus took care of it. All in all, the package is a  good deal,but just run a scan on the FlashPath before you load anything  with it.","Compact, flexible, easy to use and dependable, this is an unbeatable camera for the price.  Image quality is very good, especially if you use the included software to enhance it.  Comes with a bunch of cables, including one that lets it output to a TV, and best of all, a floppy  adapter.  This device (which normally sells for around $) lets a  standard floppy drive read the camera's SmartMedia card, and is by far the  most convenient way to upload images to your PC.","I received the Olympus 400 for an anniversary gift and I find it to be alot of fun printing your own pictures and editing them to suit your own taste.","I started using this camera two months back and have found it to be good in all aspects of the camaera world.  I use it for a hobby and am thoroughly pleased with all of the scenes i have taken some 800.  The only  flaw is the need for and ac adapter.  Other than that it is and excellent  camera.","This is a wonderful camera, it does more than I can totally learn in one setting.  The instruction manual is easy to read and follow. My first pics were a snap and I'm sure will only get better.  My only criticism is that  it doesn't come with the requisite software to use the floppydisk adaptor.  Thank goodness Olympus has a great website that not only can you get your  questions answered, but you can down load instructions and software to make  the connection between camera to floppy disk adaptor to computer relatively  easy.","I have one of these and love in, except that a) it uses Smart Media memory cards, not Compact Flash memory cards, so it isn't easily upgradable to a bigger memory card, b) the software that comes with is is kinda clunkly,  (have to use the special program to download images, can't use a TWAIN plug  in), and finally, the camera doesn't get very many high resolution pictures  on a single card.<br />Other than that, I think it is a great camera.","I have had several Digital Cameras, And this one is the most trick! Great quality shots, Realatively easy to learn & use, And the quality of the  optics and camera is super, \"just be careful with the little doors for  the memory & connectors\".","Having owned and seen many digital cameras, this is probably one of the best out there for the price.  While the feature set isn't as rich as the  Nikon 950 and the largest images are a bit smaller in pixel size, the CCD  responds excellently.  The low-light response is the BEST I have seen in a  digital camera.","Olympus quality lens.  Excellent flash photos.  Excellent sunlight photos.  Fair low light photos. If there's a way to get an extended warranty on this camera, get it.  The cover will not hold up if you use this camera  heavily. (I take 400-500 pictures a day with it, and open the lens cover  20-30 times a day)  I use the camera commercially, and it was the best  choice after weeks of research.  The LCD display is very expensive to  repair, so if you don't have an extended warranty, be careful with the  display.  With a tripod and the supplied cables, you can set up some  creative photo ideas.  Use your imagination and you will become an Olympus  fan.","This camera is relatively easy to learn and it has many features that make it attractive, such as the flash memory unit, on-camera erase, on-camera view, and other features that make this an excellent purchase.  I have  printed some of the photos that I have taken from my home computer and the  people who received them thought they were better than any they had gotten  from a professional in the past and I'm not that good.","The Olympus D-400 is an excellent Digi-cam for the money. But beware of the Bloodhound Virus which came with the included FlashPath Floppy Adapter. Luckily, Norton's Anti-Virus took care of it. All in all, the package is a  good deal,but just run a scan on the FlashPath before you load anything  with it.","Compact, flexible, easy to use and dependable, this is an unbeatable camera for the price.  Image quality is very good, especially if you use the included software to enhance it.  Comes with a bunch of cables, including one that lets it output to a TV, and best of all, a floppy  adapter.  This device (which normally sells for around $) lets a  standard floppy drive read the camera's SmartMedia card, and is by far the  most convenient way to upload images to your PC.","I received the Olympus 400 for an anniversary gift and I find it to be alot of fun printing your own pictures and editing them to suit your own taste.","I started using this camera two months back and have found it to be good in all aspects of the camaera world.  I use it for a hobby and am thoroughly pleased with all of the scenes i have taken some 800.  The only  flaw is the need for and ac adapter.  Other than that it is and excellent  camera.","This is a wonderful camera, it does more than I can totally learn in one setting.  The instruction manual is easy to read and follow. My first pics were a snap and I'm sure will only get better.  My only criticism is that  it doesn't come with the requisite software to use the floppydisk adaptor.  Thank goodness Olympus has a great website that not only can you get your  questions answered, but you can down load instructions and software to make  the connection between camera to floppy disk adaptor to computer relatively  easy.","I have one of these and love in, except that a) it uses Smart Media memory cards, not Compact Flash memory cards, so it isn't easily upgradable to a bigger memory card, b) the software that comes with is is kinda clunkly,  (have to use the special program to download images, can't use a TWAIN plug  in), and finally, the camera doesn't get very many high resolution pictures  on a single card.<br />Other than that, I think it is a great camera.","I have had several Digital Cameras, And this one is the most trick! Great quality shots, Realatively easy to learn & use, And the quality of the  optics and camera is super, \"just be careful with the little doors for  the memory & connectors\".","Having owned and seen many digital cameras, this is probably one of the best out there for the price.  While the feature set isn't as rich as the  Nikon 950 and the largest images are a bit smaller in pixel size, the CCD  responds excellently.  The low-light response is the BEST I have seen in a  digital camera.","Olympus quality lens.  Excellent flash photos.  Excellent sunlight photos.  Fair low light photos. If there's a way to get an extended warranty on this camera, get it.  The cover will not hold up if you use this camera  heavily. (I take 400-500 pictures a day with it, and open the lens cover  20-30 times a day)  I use the camera commercially, and it was the best  choice after weeks of research.  The LCD display is very expensive to  repair, so if you don't have an extended warranty, be careful with the  display.  With a tripod and the supplied cables, you can set up some  creative photo ideas.  Use your imagination and you will become an Olympus  fan.","This camera is relatively easy to learn and it has many features that make it attractive, such as the flash memory unit, on-camera erase, on-camera view, and other features that make this an excellent purchase.  I have  printed some of the photos that I have taken from my home computer and the  people who received them thought they were better than any they had gotten  from a professional in the past and I'm not that good.","My wife and I have always been a bit lazy about taking pictures until we bought this camera. Now it is easy to take the pics, view the pics on the LCD, and amazingly easy to download them onto our home computer to send to  our families. This camera is a winner as it makes you take more pictures  because it is fun and best of all you end up saving money because it is  digital and therefore nothing needs to be developed.","I have owned several, but NONE have beat this camera for total value. Don't hold back. Buy it. It is easy to use. Gives good battery life with rechargable batteries, does excellent close-ups.","I upgraded from the 320L Olympus to the 400Z and what a difference! I can now create beautiful 8 X 10 photos printed by my Epson 800 at 14400. People cannot believe that these photos were printed on paper or were taken with a  digital camera. Also, the 400 will take a 32 meg Smart Media chip. This  means one can take 72 Super High Quality pictures with one chip. Then,  after transferring them to your computer,  a button will delete these and  you can start anew. Having a camera whose cover closes over the lens is  also great protection. This camera is the best!","I am very happy with this camera. I took the D-340R back to the store and bought this D-400Z instead. It takes way better pictures! They are so much brighter and vivid. Everyone I showed was very impressed. One friend was so  impressed that he is going to buy one! I wanted it mostly for putting  images on Ebay but I like to use it as a replacement for my Canon EOS  camera. No film, no developing. I highly recommend this camera. I think it  is a wise choice!","This is a terrific camera, and not having to buy film lets you take pictures where you wouldn't have before (like whiteboard sessions at work). I would recommend getting the Olympus NiMH batteries which last a very long  time. They're expensive, but remove the battery hassle. Also a 16mb  Smartcard is a good investment. Lastly, a good tripod, since you will be  tempted to take low light pictures and it is hard to do without blurring.  Have fun!","You can extend the life of the batteries by avoiding the ever present temptation to review every picture you take through the LCD screen. Also, leave the screen off when you take pictures and use the traditional view  finder, the batteries seem to last as long as a regular 35MM.  A side  note, I remember paying $799.99 at a well know merchandise center in April  '99. Great price here. Additionally, I believe the Flashpath Smart Media  Adapter is a must!  Loading full images through the camera cables is like  connecting at 14,400 baud vs. ISDN T-3!","I purchased this camera being I'm going to be a new grand-father this year and figured what a great advantage it would be to view my pictures on a TV right after taking them. One cable from the camera to the TV and your  viewing your photo's on the big screen. This camera was easy to learn to  use. The pictures are of professional quality. To pull up your pictures on  your PC could not be easier. Just put the film or smart card as it is  called into the floppy disc adapter which comes with this model and your  ready to go. The soft wear that comes with the camera is also easy to use.  For a printer I use a HP 2000C. With this camera and the printer I am able  to produce photo quality pictures. I would strongly recommend the D-400  Zoom to any one who is in the market for a digital camera.","Many great options, clear, crisp pix's!!!!! Like the incased zoom. Also the option for different quality pix's I can take. I have rechargable batteries (two sets to interchange) and they last fairly long.","This is a very compact camera with a high quality zoom lens and all the features you could want. It is no more battery hungry than other digicams. Its image quality is the best I have seen for its 1280x960 resolution with  one caveat - many shots taken in \"auto\" (the default) or  \"sunlight\" white balance mode have a bluish cast, presumably put  there by overcompensating white balance circuitry. This cast unfortunatley  mutes reds, greens and yellows. However, I have found that if you take all  pictures in \"cloudy\" white balance mode, the cast is removed and  the camera produces  excellent color. Before you buy any digital camera, I  recommend that you visit one or more of the digicam review sites on the web  in order to examine sample images from the camera and read the reviews and  especially the user comments.","my kids gave me this for x-mas. took it to europe and loved how it worked.regular batteries work well but i can see the advantage of rechargables."]},{"name":"Kodak DC260","amazon_reviews":["I like it","Wont read my card so cant actually take photos ): I've tried troubleshooting this problem but no success","I ordered this because it was cheap, funny looking, and it has nearly a full frame sensor.<br />But I never expected much picture quality wise from something going on 15 years old.<br />I read professionals writing all the time how digital cameras don't last but I think they are wrong.<br /><br />This camera takes very nice photos, I took it to the zoo, to a botanical garden, and other places and printed at 5x7 they are<br />beautiful photo quality pictures.<br /><br />In low light the quality just isn't there but outside on a sunny day I was very surprised by the nice photos this can take.<br />It just goes to show you that you don't need the very latest equipment to take beautiful pictures.","The camera met all my expectations. I am performing a good job with the device.","I have had my DC for over 2 years, it has travelled over 50,000 miles with me all over and I love it. Never once had a problem with it. The camera was \"state-of-the-art\" in 2000 when I bought it but has been replaced by better ones now.<br />The Good<br />Solid construction, reliable<br />Excellent Image quality !!!!!!<br />Superbly configurable<br />Programmable via scripts(write your own scripts)<br />Decent Zoom and LCD<br />Fantastic low light photography when you shoot manual and especially indoors within a limited line of sight<br />All kinds of connections to TV,InfraRed etc<br />All cables included<br />SUPER VALUE!<br />The Not so Good<br />Bulky!<br />Battery Bandwidth (throw away alkaline batteries, they last 4-5 pics with LCD on, get a solid NiMH rechargable batt)<br />LONG WAIT between shots (5-6 second delay)<br />Overall, a super product, got my money's worth a long time ago. If you find one cheap, go for it. Trust me, unless you are a PRO or techie, a multi meg pixel camera wont make a difference!","The Kodak 260 is a good camera.  It has a zoom feature to include exclude things you do not want in a picture.  It also gives you the choice of selecting the picture quality based on how you are going to use the pictures (i.e. on screen, 5x7's, 8x10's, etc.)  This allows you to increase/decrease the number of pictures you can take before being required to upload or change memory modules.  All the selections can be made on the camera using the onscreen display.  The camera has a lot of functions and can also transfer picture using the infra-red connector.  It comes with software and cables to connect to your computer in the case that you don't have an infra-red port.  Overall I would rate this camera 4 of 5 stars.","This camera replaces my Sony MVC-FD88 digital camera.  There is no comparison.  The DC290 takes true photographic qualitiy pictures.  I tried the camera in a variety of difficult lighting situations.  It took perfect  pictures every time!  The software interface is great.  It makes the camera  look like another drive letter in your computer.  When the camera is  plugged into the computer (USB port), the drive letter appears in windows  explorer.  You can then simply navigate and use the standard cut and paste  tools to move the files.  I am extremely impressed with the qualitiy of the  pictures, ease of use, and clear instruction manuals.  The camera does eat  the batteries.  It comes with a set of disposable (so you can use the new  camera while the others are charging) and rechargeable with charger.  I  purchased a second set of rechargeable batteries.  I simply charge one set  while the other is in use.","I like it","Wont read my card so cant actually take photos ): I've tried troubleshooting this problem but no success","I ordered this because it was cheap, funny looking, and it has nearly a full frame sensor.<br />But I never expected much picture quality wise from something going on 15 years old.<br />I read professionals writing all the time how digital cameras don't last but I think they are wrong.<br /><br />This camera takes very nice photos, I took it to the zoo, to a botanical garden, and other places and printed at 5x7 they are<br />beautiful photo quality pictures.<br /><br />In low light the quality just isn't there but outside on a sunny day I was very surprised by the nice photos this can take.<br />It just goes to show you that you don't need the very latest equipment to take beautiful pictures.","The camera met all my expectations. I am performing a good job with the device.","I have had my DC for over 2 years, it has travelled over 50,000 miles with me all over and I love it. Never once had a problem with it. The camera was \"state-of-the-art\" in 2000 when I bought it but has been replaced by better ones now.<br />The Good<br />Solid construction, reliable<br />Excellent Image quality !!!!!!<br />Superbly configurable<br />Programmable via scripts(write your own scripts)<br />Decent Zoom and LCD<br />Fantastic low light photography when you shoot manual and especially indoors within a limited line of sight<br />All kinds of connections to TV,InfraRed etc<br />All cables included<br />SUPER VALUE!<br />The Not so Good<br />Bulky!<br />Battery Bandwidth (throw away alkaline batteries, they last 4-5 pics with LCD on, get a solid NiMH rechargable batt)<br />LONG WAIT between shots (5-6 second delay)<br />Overall, a super product, got my money's worth a long time ago. If you find one cheap, go for it. Trust me, unless you are a PRO or techie, a multi meg pixel camera wont make a difference!","The Kodak 260 is a good camera.  It has a zoom feature to include exclude things you do not want in a picture.  It also gives you the choice of selecting the picture quality based on how you are going to use the pictures (i.e. on screen, 5x7's, 8x10's, etc.)  This allows you to increase/decrease the number of pictures you can take before being required to upload or change memory modules.  All the selections can be made on the camera using the onscreen display.  The camera has a lot of functions and can also transfer picture using the infra-red connector.  It comes with software and cables to connect to your computer in the case that you don't have an infra-red port.  Overall I would rate this camera 4 of 5 stars.","This camera replaces my Sony MVC-FD88 digital camera.  There is no comparison.  The DC290 takes true photographic qualitiy pictures.  I tried the camera in a variety of difficult lighting situations.  It took perfect  pictures every time!  The software interface is great.  It makes the camera  look like another drive letter in your computer.  When the camera is  plugged into the computer (USB port), the drive letter appears in windows  explorer.  You can then simply navigate and use the standard cut and paste  tools to move the files.  I am extremely impressed with the qualitiy of the  pictures, ease of use, and clear instruction manuals.  The camera does eat  the batteries.  It comes with a set of disposable (so you can use the new  camera while the others are charging) and rechargeable with charger.  I  purchased a second set of rechargeable batteries.  I simply charge one set  while the other is in use.","This camera is the best digital camera that I could find on the market when I bought it last June.  The quality of pictures in the best mode is astonishing.  In fact, even in the lowest mode, the quality is great.  The rechargeable batteries that it comes with aren't great, but if you don't  spend too long looking at the LCD display, you'll be fine.<br />The best  thing about this is that you won't be disappointed with the picture  quality.  I got it to take pictures of my new baby, and they're better than  the ones I've taken with my 35mm.","I am an architect and have been using the camera for taking construction progress photos since it first came out.  I have found that the battery  life is best when I use NiMH rechargable batteries. I carry an extra set at  all times.  Using the highest quality image setting and a 30 MB flashcard,  I can get about 45 shots.  I use flash quite a bit for interior shots, and  this of course reduces battery life just a bit.  I don't quite trust the  wimpy little wrist strap, so usually I use a camera bag or my pocket (One  of the reasons I bought it was the compact size, compared to other digitals  in the price range). I also purchased several auxiliary lenses - a super  wide angle and a couple of close-up lenses - from Kodak, and find them  quite useful.  For my work, being able to date stamp is essential, although  I suppose all digitals probably allow date/time stamping.  My major  criticism is the lack of recovery time after taking a shot.  The longer the  batteries have been in use, the longer the wait.","Great picture quality and color balance. Easy to use, but slow between shots. It does eat batteries when the LCD screen is on, but using it only  when you need it and getting N-Mh batteries (two sets) cures this problem  easily.","I have had my DC260 for about 9 months now and I have been very pleased with the results. The pictures are every bit as good as a good point and  shoot...without the film expense!<br />I print a lot of 4x6 prints from the  camera on my HP Photosmart printer and you cannot tell them from a good  35mm print. Well actually you can....the prints from my DC260 and printer  are better!<br />I bought Ni-MH batteries and charger and they are a MUST. I  don't have problems with the batteries draining too fast with the N-MH.  Another must have is a USB ScanDisk compact flash card reader. It's  lighting fast and saves camera batteries since you just pop the card from  the camera and then download to your PC. You need the fast download you get  from the USB because you will take a LOT more pictures with a digital  camera. There is one last MUST have and that's MSPicture-it2000. I have  just about all the photo programs...but the only one I loaded on my new  computer was Picture-it.<br />The only negative to the camera is that it takes  a little long to process mulitple pictures...this camera is not for quick  action shots!<br />I have been VERY happy with my digital camera and my  \"digital darkroom\" setup.","I have been using the DC260 for almost a year and the pictures are 100% fabulous! no complaints there... But the AA battery life is terrible (good for maybe 10 shots) and the delay in pressing the actuator to taking a  picture is rather long... As with all digital cameras the USB and serial  connections are slow... But if you can (and your PC has FIR), try the built  in infra red connection... it will more than double image transfer speed!","I take mine scuba diving, and one of the things I love about it is using the \"Instant Fix\" button in Adobe PhotoDeluxe to bring up all the \"hidden\" colours (everything appears blue or green underwater).  But the one thing I hate is the delay between pressing the button, and  taking the picture.  It can be very hard to stay still for that long when  there's a swell!  I use NiMH rechargable batteries, and they last for 2-3  dives/day if I don't use the LCD screen.","I've had this camera for 8 months and I'm on my THIRD one from Kodak.  Each has the same problem, it eats batteries like crazy.  You CANNOT use conventional alkaline batteries - not even KODAK brand PhotoLife batteries  - they last less than a dozen or so shots!  And it freezes up on occassion  and the only way to reset it is to open the battery compartment and release  the batteries then reset it by closing the battery compartment.  Three  cameras and all have the same problem - not good!  Not exactly the best  design either - clumsy to hold and awkward to use - not much thought went  into the design of this particular model while other Kodak models seem  better designed... not smart for the \"top of the line!\"<br />No  wonder Kodak discontinued this model.  Now if they will only take it back  and give me one that works!  (in defense of this model - it does take great  shots and while the download via USB is sluggish at best, the outcome is  the best I've seen in any digital.","After 15 years freelancing with a 35mm system, this is the first digital to balance price, image quality and ease of use in moving files. First started using it parallel with film to support an industrial client's web  pages. Now client appreciates my ability to remotely file same-day images  of emergency operations.<br />It's obvious I wish this camera had more lens  options, but it's doing the job at a fraction of the cost of comparable  professional digitals.","I have taken over 2,200 pictures with this camera and I am amazed of the quality.  Even pictures that I didn't think would come up due to poor lighting come out excellent.  The medium resolution is my favorite.  It  gives the best balance between picture size and storage.<br />The USB  interface allows you to drag the photos from the camera to your computer.  You just highlight all the pictures and drag them to the folder you want to  store them in. It transfered each image fast but there is a long pause  between each picture.  I purchased a USB card reader and it copies about 15  times faster.<br />Basically don't think that the USB interface for the Kodak  means fast downloads, it will be just as slow as serial (or even slower).","The picture quality of this camera is fantastic! I've taken over 2,000 pictures with it and nearly everyone has been as good as film. I even took pictures of fireworks in DC and it had no problems adjusting to the  lighting. It's a little slow writing pictures to Compact Flash at times. At  the low res setting, you have to wait about 6 seconds after every 4  pictures. Other than that, this is a great camera.","I bought this camera when it first came out, and have been happy with the results ever since. It still has amoung the best resolution over a year later.<br />I do recommend a LARGE memory card, 48 or 64 Mb.","I've had one of these for a while, and this is truly an excellent camera.  Clean, clear picture quality.  Easy to review/delete pictures currently in the camera with the LCD screen.  Super-fast transfer of the images if you  add a PCMCIA SCSI card reader to your PC or Mac.  Add a huge flash card for  high capacity (98 highest-quality pix on a 48MB card).<br />Only things I  don't like about it is that the 'manual focus' isn't truly manual--you can  choose from a number of set distances, and same with the exposure.","I found the high resolution images make this camera more versatile.  Not only can I can share photos with friends by e-mail, but I can crop small parts of the photos and these parts become great images in their own right.  For example, from an image of a croud of people at a graduation party, I  was able to print an excellent 8x10 of a couple that had just become  engaged.  I recommend buying and using a 32 meg flash memory with the 8  meg as a back-up.  I also like that the camera can connect to my  computer's USB port because my LPT1 port was already over-used.  The only  downside is that this camera EATS batteries (but probably no more than  other digital cameras.)"]},{"name":"Sony Mavica FD-91","amazon_reviews":["I suppose I ought to be embarrassed for still using this camera for webwork in 2015. But I've got to say that the thing just keeps on keeping on. It's SO easy to use and gives such great images.<br />If I need higher DPI, I go to film now as I just can't get pro photos from anything except a camera that takes a year to learn how to use and pay for.<br />The optics in this things are incredible and the internal zoom doesn't shut out any light like zooms that extend. I've used mine since about 2002 and no one could wrench it out of my hands ( I've got two now).<br />Face it, $1000.00 was a lot of money back in 1998 and I haven't found a camera that does what this one does without selling my first-born since then. It's great on a tripod. Not interested in lugging it around, tho","I picked up this 33-ounce dinosaur-of-a-camera at a yard sale, for $ 5.00, simply because I was intrigued with its well thought-out design and many clever features.<br /><br />There are two major points I'd like to make, before delving into the details of this camera:<br />If you're going to seriously use this camera, be sure to purchase a Sony (or an equal capacity clone) NP-F550 InfoLITHIUM battery, 7.2V, 18.5Wh = 2500mAh, Li-ion.<br />Maximalpower SON NP-F550 Battery for SONY InfoLithium L NP-F330 NP-F550 NP-F570 CCD-SC55 CCD-TR516 CCD-TR716 CCD-TR818 CCD-TR910 CCD-TR917 2500mah fully decoded w/3yr warranty<br />This will last all weekend, going through multiple 1.44MB 3.5-inch, 2HD, DOS formatted diskettes, and still show no signs of discharging.<br />Only batteries with the internal \"InfoLITHIUM\" microchip will work in the MVC-FD91. Believe me, I've tried. I removed the vertical plastic rib inside the battery compartment and inserted a generic 7.2V Lithium-ion battery, but an error message appeared on the display and the camera promptly shut down.<br />And the standard Sony NP-F330 (7.2V, 5.0Wh = 676mAh, Li-ion) InfoLITHIUM battery will only get you through one 1.44MB 3.5-inch, 2HD, DOS formatted diskette  -and that's provided you don't decide to erase any photos in the process.<br /><br />The next important point is that the Sony MSAC-FD2 Memory Stick Floppy Disk Adapter  -or any brand of floppy disk adapter, will not work with the MVC-FD91. You're confined to basic 1.44MB 3.5-inch, 2HD, DOS formatted diskettes on this camera. I know, the Sony MSAC-FD2 was a Memory Stick Floppy Disk Adapter that was designed to be compatible with many of the Sony Mavica series cameras with internal 3.5-inch diskette drives. But the MVC-FD91, unfortunately, was not one of them. The Sony Mavica series cameras, that did work with the floppy disk adapter, had a small switch inside to detect the adapter and align the head. So attempting to use any flash memory floppy disk adapter, in the Sony Digital Mavica MVC-FD91 camera, will only generate a disk error message on the display. Anyway, even those Sony Mavica cameras that were designed to use a flash memory floppy disk adapter: Its two CR2016 internal batteries entered discharge mode everytime the floppy disk adapter was inside a 3.5-inch disk drive, in the Mavica series camera or in the computer. Not exactly an efficient design.<br /><br />I find that this legacy camera is still quite useful for certain applications. For example, when taking photos and portraits of others, at public events, is infinitely easier when they want me to email them a copy of the photo: I simply take the floppy disk out, note their photo frame on the label, and let them write down their email address on the disk label, with a pencil. So easy!<br /><br />And for those fast photo shots, I much prefer the fully articulated 2.5-inch viewing screen and external buttons on this Sony MVC-FD91 Mavica, to wading through the screen menu on the newer digital cameras.<br /><br />For those who truly miss the days of the 35mm single lens reflex film camera, read on, as this one just might be the digital camera for certain limited applications. The shutter release triggers an unmistakable electronic sound that mimics the mechanical shutter release of vintage 35mm SLR film cameras. This camera was shrewdly designed to wean old school photographers from their 35mm SLR film cameras. With automatic/manual toggle on many features, this digital camera does give the skilled photographer considerable control of every shot.<br /><br />And those who wax nostalgic about their old 4x5 sheet-film view cameras will feel quite at home, using a heavy tripod, black cape, and frequent switching of the 1.44MB 3.5\" diskettes, although the lens is permanently at 90 degrees to the digital CCD image sensor, and the digital resolution is much less than 4x5 sheet film images. But I'm not really joking about the black cape, as it is still helpful for those shots in the field that require careful manual focusing. But I have since attached a \"eFilm DU2.5\"-M\" fold-out sunshade (see link posted below) to the 2.5\" TFT color LCD monitor, and while not as good as the black cape, it's more convenient, not as ridiculous, and greatly helps in direct sunlight. It also protects the 2.5\" LCD monitor from damage, when the camera is not in use.<br />Delkin Devices DU2.5-M Universal Pop-Up Shade for 2.5-Inch LCD Screens<br /><br />Sporting a 2.5-inch TFT color LCD monitor that physically rotates 180 degrees, the camera functions quite well for flat-field copy shots, when mounted vertically, and pointed down at a copy board with side illumination. This camera also has a \"optical\" digital through-the-lens viewfinder, not unlike those of the single lens reflex 35mm film cameras of yore  -great for action shots in bright sunlight. The two viewing modes, both fully digital, are easily toggled back and forth as needed. There is also dioptic adjustment on the \"optical\" digital viewfinder for those who wear glasses.<br /><br />But, instead of using manual focus, I have found a way to be expedient in the field, by leaving the camera on \"Auto Focus\" mode, as well as \"Steady Shot\" image stabilization mode, and then on my laptop at home, opening up each photo in \"iPhoto Plus 4.0\"  -or any photo manipulation software, and electronically enhancing the sharpness by only one increment. \"IrfanView\" will also do this, and will even batch process the sharpness of all of the photos in one sweep, if needed. The photo resolution is not changed by this, but the image really \"pops out\" and appears clearer and sharper. I uploaded some of these \"sharpened\" photos, for you to judge, but you'll have to scroll down the web page to find them.<br /><br />As I usually shoot XGA 1024x768 jpeg photos, in fine mode. The 1.44MB 3.5\" diskette has the capacity for 6 photos per 1.44MB 3.5\" diskette, and is perfect for my requirements.<br /><br />VGA (640x480) jpeg photos, set on fine mode, provide a 13-photo limitation per 1.44MB 3.5\" diskette. Typical 640x480 fine-option jpegs can range from about 51KB to 147KB in size.<br /><br />Note: While capable of saving a bitmap photo, the 1.44MB 3.5\" diskette only has the capacity for one such photo.<br /><br />I've applied a 2.75\" x 2.125\" label to each 1.44MB 3.5\" formatted diskette, for special notes  -a definite plus for organizing photo-shoots.<br /><br />For quality ambient-light photos, I find that a sturdy, retractable mono-pod is essential in any less-than-bright sunlight situations, as the 1/3\" CCD (0.8 megapixel) sensor seems to exhibit a true ISO rating of only about 50 (although Sony optimistically specs a ISO value of 100). So, especially for those long-telephoto shots, the use of a mono-pod is mandatory, for image sharpness.<br /><br />Featuring a 14x optical zoom (5.2mm to 72.8mm) lens with auto-focus option (equivalent to a 37 to 518mm zoom lens on the old 35mm film cameras), the camera has a f/1.8 to f/11 aperture range.<br /><br />Exposure range is 1/60 to 1/4000 of a second, for ambient light, and 1/60 to 1/1500 of a second, in flash mode.<br /><br />The OEM Sony NP-F330 (7.2V, 5.0Wh, Li-ion) InfoLithium battery has adequate power to handle only one 1.44MB 3.5\" diskette, before a mandatory recharge. Attempting to load and shoot a second diskette may produce corrupted image files that are not obvious until uploaded and viewed in your home desktop computer. And don't forget that erasing images in the field still drains the NP-F330 battery, sometimes shutting down the camera before the 1.44MB 3.5\" diskette is completely filled with photos.<br /><br />But I have since purchased a generic NP-F550 (7.2V, 18.5Wh, Li-ion) battery, for all-day shoots, on multiple diskettes.<br /><br />And, as another reviewer noted: This old camera will NEVER be stolen. And I also feel that it's just too big to ever be misplaced or lost.<br /><br />And, at a market value of $ 5.00, I won't hesitate to put it in harm's way, for those demanding shots.<br /><br />I gave this camera a 3-star rating, simply because it's just too out-dated to seriously endorse. But if I had done this review back in 1999, I would have most certainly given it a 5-star rating.","This takes great pictures. Its big and bulky, which makes it easy to handle. Because it is older and clunky I don't have to worry about an employee walking off with it. The image files are small for such great pics, which make them ideal to email customers.","I just want to tell u that the camera I bought off this site is every thing I had hope for,","I bought this monster about 10 years ago for about a grand. It did everything a camera of it's day could do and more. And I still use it in my small business today. Image size is tiny today at less than a megapixel; but for general purpose documentation, which I do, it's fine. The monster zoom lens never ceases to amaze me. In the entire 10 years there have been NO camera issues whatsoever. it's been perfect and has been in use at least weekly the whole time. I have replaced the battery several times; count on it to last a couple of years with regular use. The only drawback for me is having to constanty swap floppy disks since in its max jpeg resolution, it only holds about 5-10 shots per disk, depending on image complexity. And of course, it's a pain to transfer files to a PC. You have a choice of using the LCD panel or the viewfinder, which is really handy in sunny locations. I looked at replacing it recently, but soon realized that except for image size and storage, it would cost at least $250 to replace it. So, I'm keeping it for now.","It's been along time.  I bought this camera new 7 or 8 years ago and still have it and use it.  At that time it was a high end camera, I believe, the retail price was around $999.00.  How things have changed!  Now I can only compare it to a classic old black and white movie, silly and dated, but in it's time wonderful.  It does what it does well, but with only 0.8MP it can't do much.  A 14x optical zoom?  Unheard of now!  Takeing a picture at the full telephoto setting and then passing it off as anything other then abstract art would be absurd.  Still, you've got to love them for thinking it was possible.  This camera is a wonderful artifact (why I gave it 4 stars) of a not so far off distant time in digital photography.","But with the new ones coming out, I felt a little outdated.<br />I definiteltly love the floppy disk feature of holding images. It makes life soooo much easier!<br />Whenever I ran outta discs, someone always had extra or I could easily buy them very cheap.<br />The only bad thing was the battery life was soooo short and towards the last few months Ive had nothing but disc errors and lost pics.<br />I finally upgraded to a new camera but I don't regret this one at all.","...this camera is great cuz the best part you take pictures are they are on floppy already so you can jus email, save or print them out instantly...no more connecting to USB port and all that hassel!...trust me its worth the price you pay! Its includes a car charger to recharge the battery if your taking a road trip...;-)...great product for college kids!!","I suppose I ought to be embarrassed for still using this camera for webwork in 2015. But I've got to say that the thing just keeps on keeping on. It's SO easy to use and gives such great images.<br />If I need higher DPI, I go to film now as I just can't get pro photos from anything except a camera that takes a year to learn how to use and pay for.<br />The optics in this things are incredible and the internal zoom doesn't shut out any light like zooms that extend. I've used mine since about 2002 and no one could wrench it out of my hands ( I've got two now).<br />Face it, $1000.00 was a lot of money back in 1998 and I haven't found a camera that does what this one does without selling my first-born since then. It's great on a tripod. Not interested in lugging it around, tho","I picked up this 33-ounce dinosaur-of-a-camera at a yard sale, for $ 5.00, simply because I was intrigued with its well thought-out design and many clever features.<br /><br />There are two major points I'd like to make, before delving into the details of this camera:<br />If you're going to seriously use this camera, be sure to purchase a Sony (or an equal capacity clone) NP-F550 InfoLITHIUM battery, 7.2V, 18.5Wh = 2500mAh, Li-ion.<br />Maximalpower SON NP-F550 Battery for SONY InfoLithium L NP-F330 NP-F550 NP-F570 CCD-SC55 CCD-TR516 CCD-TR716 CCD-TR818 CCD-TR910 CCD-TR917 2500mah fully decoded w/3yr warranty<br />This will last all weekend, going through multiple 1.44MB 3.5-inch, 2HD, DOS formatted diskettes, and still show no signs of discharging.<br />Only batteries with the internal \"InfoLITHIUM\" microchip will work in the MVC-FD91. Believe me, I've tried. I removed the vertical plastic rib inside the battery compartment and inserted a generic 7.2V Lithium-ion battery, but an error message appeared on the display and the camera promptly shut down.<br />And the standard Sony NP-F330 (7.2V, 5.0Wh = 676mAh, Li-ion) InfoLITHIUM battery will only get you through one 1.44MB 3.5-inch, 2HD, DOS formatted diskette  -and that's provided you don't decide to erase any photos in the process.<br /><br />The next important point is that the Sony MSAC-FD2 Memory Stick Floppy Disk Adapter  -or any brand of floppy disk adapter, will not work with the MVC-FD91. You're confined to basic 1.44MB 3.5-inch, 2HD, DOS formatted diskettes on this camera. I know, the Sony MSAC-FD2 was a Memory Stick Floppy Disk Adapter that was designed to be compatible with many of the Sony Mavica series cameras with internal 3.5-inch diskette drives. But the MVC-FD91, unfortunately, was not one of them. The Sony Mavica series cameras, that did work with the floppy disk adapter, had a small switch inside to detect the adapter and align the head. So attempting to use any flash memory floppy disk adapter, in the Sony Digital Mavica MVC-FD91 camera, will only generate a disk error message on the display. Anyway, even those Sony Mavica cameras that were designed to use a flash memory floppy disk adapter: Its two CR2016 internal batteries entered discharge mode everytime the floppy disk adapter was inside a 3.5-inch disk drive, in the Mavica series camera or in the computer. Not exactly an efficient design.<br /><br />I find that this legacy camera is still quite useful for certain applications. For example, when taking photos and portraits of others, at public events, is infinitely easier when they want me to email them a copy of the photo: I simply take the floppy disk out, note their photo frame on the label, and let them write down their email address on the disk label, with a pencil. So easy!<br /><br />And for those fast photo shots, I much prefer the fully articulated 2.5-inch viewing screen and external buttons on this Sony MVC-FD91 Mavica, to wading through the screen menu on the newer digital cameras.<br /><br />For those who truly miss the days of the 35mm single lens reflex film camera, read on, as this one just might be the digital camera for certain limited applications. The shutter release triggers an unmistakable electronic sound that mimics the mechanical shutter release of vintage 35mm SLR film cameras. This camera was shrewdly designed to wean old school photographers from their 35mm SLR film cameras. With automatic/manual toggle on many features, this digital camera does give the skilled photographer considerable control of every shot.<br /><br />And those who wax nostalgic about their old 4x5 sheet-film view cameras will feel quite at home, using a heavy tripod, black cape, and frequent switching of the 1.44MB 3.5\" diskettes, although the lens is permanently at 90 degrees to the digital CCD image sensor, and the digital resolution is much less than 4x5 sheet film images. But I'm not really joking about the black cape, as it is still helpful for those shots in the field that require careful manual focusing. But I have since attached a \"eFilm DU2.5\"-M\" fold-out sunshade (see link posted below) to the 2.5\" TFT color LCD monitor, and while not as good as the black cape, it's more convenient, not as ridiculous, and greatly helps in direct sunlight. It also protects the 2.5\" LCD monitor from damage, when the camera is not in use.<br />Delkin Devices DU2.5-M Universal Pop-Up Shade for 2.5-Inch LCD Screens<br /><br />Sporting a 2.5-inch TFT color LCD monitor that physically rotates 180 degrees, the camera functions quite well for flat-field copy shots, when mounted vertically, and pointed down at a copy board with side illumination. This camera also has a \"optical\" digital through-the-lens viewfinder, not unlike those of the single lens reflex 35mm film cameras of yore  -great for action shots in bright sunlight. The two viewing modes, both fully digital, are easily toggled back and forth as needed. There is also dioptic adjustment on the \"optical\" digital viewfinder for those who wear glasses.<br /><br />But, instead of using manual focus, I have found a way to be expedient in the field, by leaving the camera on \"Auto Focus\" mode, as well as \"Steady Shot\" image stabilization mode, and then on my laptop at home, opening up each photo in \"iPhoto Plus 4.0\"  -or any photo manipulation software, and electronically enhancing the sharpness by only one increment. \"IrfanView\" will also do this, and will even batch process the sharpness of all of the photos in one sweep, if needed. The photo resolution is not changed by this, but the image really \"pops out\" and appears clearer and sharper. I uploaded some of these \"sharpened\" photos, for you to judge, but you'll have to scroll down the web page to find them.<br /><br />As I usually shoot XGA 1024x768 jpeg photos, in fine mode. The 1.44MB 3.5\" diskette has the capacity for 6 photos per 1.44MB 3.5\" diskette, and is perfect for my requirements.<br /><br />VGA (640x480) jpeg photos, set on fine mode, provide a 13-photo limitation per 1.44MB 3.5\" diskette. Typical 640x480 fine-option jpegs can range from about 51KB to 147KB in size.<br /><br />Note: While capable of saving a bitmap photo, the 1.44MB 3.5\" diskette only has the capacity for one such photo.<br /><br />I've applied a 2.75\" x 2.125\" label to each 1.44MB 3.5\" formatted diskette, for special notes  -a definite plus for organizing photo-shoots.<br /><br />For quality ambient-light photos, I find that a sturdy, retractable mono-pod is essential in any less-than-bright sunlight situations, as the 1/3\" CCD (0.8 megapixel) sensor seems to exhibit a true ISO rating of only about 50 (although Sony optimistically specs a ISO value of 100). So, especially for those long-telephoto shots, the use of a mono-pod is mandatory, for image sharpness.<br /><br />Featuring a 14x optical zoom (5.2mm to 72.8mm) lens with auto-focus option (equivalent to a 37 to 518mm zoom lens on the old 35mm film cameras), the camera has a f/1.8 to f/11 aperture range.<br /><br />Exposure range is 1/60 to 1/4000 of a second, for ambient light, and 1/60 to 1/1500 of a second, in flash mode.<br /><br />The OEM Sony NP-F330 (7.2V, 5.0Wh, Li-ion) InfoLithium battery has adequate power to handle only one 1.44MB 3.5\" diskette, before a mandatory recharge. Attempting to load and shoot a second diskette may produce corrupted image files that are not obvious until uploaded and viewed in your home desktop computer. And don't forget that erasing images in the field still drains the NP-F330 battery, sometimes shutting down the camera before the 1.44MB 3.5\" diskette is completely filled with photos.<br /><br />But I have since purchased a generic NP-F550 (7.2V, 18.5Wh, Li-ion) battery, for all-day shoots, on multiple diskettes.<br /><br />And, as another reviewer noted: This old camera will NEVER be stolen. And I also feel that it's just too big to ever be misplaced or lost.<br /><br />And, at a market value of $ 5.00, I won't hesitate to put it in harm's way, for those demanding shots.<br /><br />I gave this camera a 3-star rating, simply because it's just too out-dated to seriously endorse. But if I had done this review back in 1999, I would have most certainly given it a 5-star rating.","This takes great pictures. Its big and bulky, which makes it easy to handle. Because it is older and clunky I don't have to worry about an employee walking off with it. The image files are small for such great pics, which make them ideal to email customers.","I just want to tell u that the camera I bought off this site is every thing I had hope for,","I bought this monster about 10 years ago for about a grand. It did everything a camera of it's day could do and more. And I still use it in my small business today. Image size is tiny today at less than a megapixel; but for general purpose documentation, which I do, it's fine. The monster zoom lens never ceases to amaze me. In the entire 10 years there have been NO camera issues whatsoever. it's been perfect and has been in use at least weekly the whole time. I have replaced the battery several times; count on it to last a couple of years with regular use. The only drawback for me is having to constanty swap floppy disks since in its max jpeg resolution, it only holds about 5-10 shots per disk, depending on image complexity. And of course, it's a pain to transfer files to a PC. You have a choice of using the LCD panel or the viewfinder, which is really handy in sunny locations. I looked at replacing it recently, but soon realized that except for image size and storage, it would cost at least $250 to replace it. So, I'm keeping it for now.","It's been along time.  I bought this camera new 7 or 8 years ago and still have it and use it.  At that time it was a high end camera, I believe, the retail price was around $999.00.  How things have changed!  Now I can only compare it to a classic old black and white movie, silly and dated, but in it's time wonderful.  It does what it does well, but with only 0.8MP it can't do much.  A 14x optical zoom?  Unheard of now!  Takeing a picture at the full telephoto setting and then passing it off as anything other then abstract art would be absurd.  Still, you've got to love them for thinking it was possible.  This camera is a wonderful artifact (why I gave it 4 stars) of a not so far off distant time in digital photography.","But with the new ones coming out, I felt a little outdated.<br />I definiteltly love the floppy disk feature of holding images. It makes life soooo much easier!<br />Whenever I ran outta discs, someone always had extra or I could easily buy them very cheap.<br />The only bad thing was the battery life was soooo short and towards the last few months Ive had nothing but disc errors and lost pics.<br />I finally upgraded to a new camera but I don't regret this one at all.","...this camera is great cuz the best part you take pictures are they are on floppy already so you can jus email, save or print them out instantly...no more connecting to USB port and all that hassel!...trust me its worth the price you pay! Its includes a car charger to recharge the battery if your taking a road trip...;-)...great product for college kids!!","I have owned this camera for over 2 years now, and absolutely love this camera.  It takes great pictures.  I normally use the 640x480 pixel option.  I normally get about 23 pictures to the floppy on this setting.  There is an exposure modifier, which will allow you to darken bright pictures, and brighten dark pictures, by modifying the apeture, and shutter speed.  They are both controlled automatically, but they are adjustable up to +1.5 to -1.5.  There is also auto, or manual white balance, for use in compensation for incandescent, and florescent lighting.  There is a 14x optical zoom, one of the best in the industry.  There is a 52mm ring, for attaching filters.","sony makes a good camera and i just love it i just got it and uses it all the time its easy to use and to download pictures to my pc the pictures are clear and in focus you can make a short movies with this camera and download them to your pc so you can send movies in your e-mail [short movies about 60 seconds]","This camera has many unique features that make it perfect for the right person.  First, it doesn't store pictures on memory cards like most cameras, it stores on floppies.  This means you probably already have the \"memory.\"  When I first purchased this camera, that was great because 16 MB memory cards were expensive and if you were taking a lot of pictures, it could add up real quick.  Now, 128 MB memory cards are cheap and will hold 100x the pictures a floppy will hold.  That said, the picture quality is great for this class, and the zoom will astound you.  A friend has this same camera and uses some passive flash units with it to create off-center flash lighting.  The built-in flash is only good for a narrow distance range of about 10 ft.  Much closer and it floods the subject, much further and it doesn't reach, but this is easily overcome, plus, you don't need a flash with this camera in many situations where a conventional camera would need one.  The flippable lcd display will flip so it shows to the front and automatically flips the image so you can see the framed image when doing self-portraits.  Includes auto or manual focus and f-stop modes.  It also takes very short movies with sound. Optional optical viewfinder.  Rechargeable Infolithium batteries operate well but buy at least one spare.","I've had my FD91 for over two years and have taken thousands of images. The camera is bulky and heavy, but with 14x zoom it outperforms most others. Sony Steadyshot feature is great for the long lens.<br />Images are good. Some will have the jaggies, but color is great. Now being outdone by new megapixel cameras.","I've owned this camera since it first came out and it was definitely worth the expenditure.  I am an electronics junkie and have all the new \"toys\" but this is most assuredly my prized possession.  Takes fantastic pictures, both close-up and telephoto.  The floppies are inexpensive, easy to get, easy to transport.  You can take pictures to your heart's content, deleting the ones that you don't like, on the spot.  No more waiting for pictures to be developed, no more wasted film.  In a world that values instant gratification, this is the perfect answer.  The camera itself, while bigger than some, is almost perfectly balanced so is quite comfortable to hold and to use.  I have acquired other cameras since my FD-91 but none has managed to take over the No. 1 spot from this beauty!  Go for it!","I have owned the Mavica FD 91 for about a year and I love it I use it to take pictures of butterflies and other insects and it works great especially when you use a maginfying glass to really bring things close up","I bought my FD91 shortly after they first came out. While the camera does have some limitations, the benefits far outweigh them. Great for pictures in almost all lighting conditions. The 14x lens was the biggest selling point. It's great for everything from wildlife photography to sporting events. The limited resolution can be a problem. Don't plan on enlarging any of the photo's, the pixels become apparent quickly. It was a great purchase at (this price) and at the current price a steal. I hope they put they 14x lens back in in some of the higher resolution models. That would be a killer combination.","I love this one! It's a little bulkier than the rest, but I got used to it immediately. I use it daily to take hundreds of photos for my business. It's ideal! The quality of the photos is fantastic.","I purchased one to be used at work for our dept. to conduct \"how to\"pictures. Word got out how good it was, then everyone was using it and they loved it, in fact, someone loved it so well they took it home and never brought it back.<br />We are now looking at purchasing another just like it.<br />It is very simple to use, even for a beginner, and you don't have to find a computer to download the pictures.<br />Takes great photos.<br />I do recommend you purchase a rechargable spare battery, this saves time.","I picked this camera up when it first came out, i paid a little over a thousand for it, the deal here on amazon is amazing. This camera, is definitely worth the money that i paid, therefore it is without a doubt a hot buy here for its current price.<br />The camera is truely state of the art, one of my many favorite features of this camera would have to be the usage of a 3.5 floppy disk. thats right folks, you simply insert a 3.5 floppy disk into the side of the camera, and vwoala! you snap pictures, when that is used up, insert another one. if the disk isnt formatted, the camera will format it for you. you then insert the disk into you hard drive (Computer drive, that is) and view your pictures.<br />The picture quality is wonderful, its clean and crisp. I actually used this at my brothers highshool graduation, took the pictures home, and printed them out. The pictures came out fantastic. not only did i snap pictures, and delete the ones that i didnt like right from my camera, i recorded approx 30 seconds worth of video footage, which can be used with real player.<br />This camera is one of my favorite electronic goodies around my house, and i have a lot of electronic goodies. The zoom on this camera is quite good, but it pales in comparison to the 1.4X zoom lens that i bought for this camera, man, now that thing is sweet. can we say telescope?!<br />This camera is definitely worth the mula. whether youre looking for a camera for recreational use (like me), or if youre going to use it as a professional photographer (like my dad's friend, who introduced it to us) this camera will satisfy your needs, and then some.<br />It's a fun little gadget, its easy to use, and you'll love it. It's true, it gets the complete 5 stars.","This camera is one of my prized possessions.  It's true optical zoom, coupled with the standard Mavica features make this a really good piece of equipment.  I only wish the resolution was a bit better, as most local developers are unable to print Mavica shots at all... they look horrible!  But, I tried kodak.com, and was really impressed by the results, they looked great.  All in all, this camera was worth every dollar I paid for it.","First of all, a confession...I am not \"Joe-digital camera.\"  I don't get involved in discussions about how many mega-pixels a camera has, etc., but I know that I am sold on the Sony Mavica line in general, and on this camera in particular...here's my story...<br />When my department found enough funds to purchase a digital camera I campaigned for a SONY Mavica. I had used one briefly, with nothing but success.  What a camera, easy to use, and good results, too!  We went the rounds about pixels, and the rest...but in the end the point that tipped the scales was that this camera has an option that other makers simply didn't offer, the ability to use standard 3.5\" floppies.<br />The 3.5\" floppy option is perfect for us.  The camera is used by multiple people (including students), who work at their own computers.  That means that we could avoid having to track down the patch cords for downloading, hassles associated with multiple station use of software, and etc.  Whew!<br />The camera has a 14x zoom capability that makes it easier to use the entire frame.  You can take photos at different resolutions, depending on the use and the number of images you want to put on each disc.  In addition to still images, this camera lets you make MPEG files.  They're fun, and they can be useful.<br />As for ease of use...I was taking pictures in less than 5 minutes after I picked up this camera for the first time -- and this is the first digital camera I ever used!  When you take photos you have the option of using a viewfinder or a small LCD screen to frame your photo.  As a long-time 35mm SLR camera fan I the eyepiece a comforting option.  After a while I suppose I could get used to the LCD screen...it's a reasonable size, and in color.<br />The camera's menu system is easy to use, you can even delete unwanted photos immediately.<br />Be prepared for a camera that's a bit bigger than most digital cameras out there.  This camera is comparable in size and weight to many changeable lens 35mm cameras systems.  On the plus side, the design is ergonomic.  It feels good in your hand.  The grips are well designed, there is someplace for your hands and fingers to go.  I like that.<br />Our department bought this camera at full price.  At the currently discounted price I'm toying with the idea of getting one of these for myself...but I better talk to the wife about that (hint -- that's always a good plan).<br />To sum up, this is a great camera.  It's convenient, easy to use, and a great deal to boot! What more could anyone ask?  And this is a lot of camera for the money!  If you take a lot of photos, the money you save in developing will eventually pay for the camera!<br />P.S.  I wonder how long it will be before my 35mm SLR is a collector's item?  Probably not too long with cameras like this one around.<br />Happy snapping!<br />Alan Holyoak, Department of Biology, Manchester College","This is an amazing camer and easy to use. I took stills and 60 second  movies 10 minutes after I got the battery charged. I'll even send a sample,  if you like dogs, if you email me at davidwalsh@home.com. It will  autimattically open in Real Media, so you don't have to install anything to  see it!","Easy to use, stores on floppy disks which go directly into the computer  (no cables or any hassles). Creates fantastic pictures with the ability to  manually set any feature you like, or use the automatic capabilities which  are well designed. I use this camera now for nearly 2 years and have not  used my film driven SRL Pentax any more, nor will I ever buy film again.","I run a small newspaper.  The FD91 has become so indispensable that I now own 2.  I can lend one out to an experienced emulsion photographer and, when necessary, teach him/her the essentials of how to use it in 5-6  minutes.  These flexible features make it perfect for my situation:  The  14:1 zoom means less cropping, and therefore higher resolution in the final  cropped photo; the swivel LCD means it's easy to shoot from a higher angle  (like over heads of a crowd or from a low angle, or even around a corner;  floppy-disk media means film is essentially unlimited, or limited only to  roughly 8x the number of disks I'm willing to carry, and they're cheap so  \"film cost\" is never a problem.  Finally, of course, in a  newspaper operation there are the digital camera advantages of immediate  availability, unlimited no-cost shooting because there are no one-time film  or processing costs.  As to resolution, the 1024x768 size means that a  landscape shot can be printed as wide as 12 inches in an 85-line screen  without apparent loss of resolution.  (But because this camera is so  oustanding, I've now purchased a third Mavica, the FD95, for its  resolution, which is 2.5x the FD91's.)  The cost equation on the FD91 is  outstanding, because although the purchase price is high, the advantage of  no film cost soon makes it the cheapest possible photo solution for anybody  who shoots a lot of pictures.","I have had mine since September of 1999 and it is fantastic!  The best feature is the floppy disk storage media.  You're out of town, no laptop mega-drive and out of storage?  Buy a $5 box of disks and shoot for another  month!<br />I bought an extra battery for mine which is real handy when  traveling.  The battery life is real good - several hours of continuous  shooting and viewing, even with the lower life battery supplied with the  camera.  These batteries also interchange with Sony video cameras, so you  can get double duty out of them if you own a video camera also.<br />I have  used the camera to take pictures to email to family & friends, Fox  & Friends, post on auction sites, send to publications and even just to  print out on photo paper.  I used the camera on a tripod to take pictures  of kids on Santa's lap this past Christmas, printing them on photo paper  with an ink jet printer - a terrific success!  The quality was not quite  35mm SLR, but it was a whole lot better and faster than a cheap 35mm.<br />I  am now experimenting with the mpeg video mode for our local track team,  many events are completed in less than the 1 minute limit in extended mode.  We may post these to the students web sites eventually.<br />All my old 52mm  lense accessories  fit this camera.  The filters, effects lenses & etc.  add to the creativity you can unleash with this camera.  The ability to  instantly check your work by viewing on the screen is impossible with 35mm.  Many years ago I considered becoming a professional photographer and back  then you had to do a test shot with a Polaroid to check lighting,  composition and so on.  I believe this camera will take the place of  Polaroids in all applications.  Don't throw out the old Nikon 35 yet  though, for true quality work, you still need film.<br />This camera also has  a whole disk or single frame copy feature that is really nice if you want  to give copies of your pictures away in the field.  You can also delete  unwanted frames to free disk space in the camera.  The controls and menus  for all these functions are intuitive and straight forward to use.<br />Exposure control is also easily accomplished with a series of  programable features.  The shutter speed, apeture, flash and white balance  can all be set manually if you don't want to use the automatic mode, which  really is adequate for most situations.  You will want to read the book  first, but once you have the basics down, it is just infinite  experimentation from there.  You can't make a mistake - just reset and try  again - you're not wasting expensive film!<br />I would recommend getting a  wide angle accessory lense; if you are taking pictures of large subjects in  tight quarters, (no, I'm not talking about Santa Claus!), sometimes you  can't backup far enough.  An extra battery, as mentioned above, is also  essential if you plan to use it traveling or on all day assignments.","I've used this digital camera many times...it's very versatile in that not only does it take good pictures but, you also can use many accessories that a photographer would normally want to use on his or her slr, i.e. close-up  lens attachments, filters etc., etc.  The amazing thing is that after  taking those wonderful pictures you eject the floppy disk and insert it  directly into your computer and go to work.  Most of my work is law  enforcement and this camera has been a God sent tool.  Other features such  as image stablizing lens and flash, what else is need, just point and  shot...go to work with your images.  The best of luck with yours.","I have been a semi-photo buff for 20+ years.  This is the second generation Sony Digital camera I have purchased.  Its a great piece of equipment and is easy to use. I particularily like being able to do the  full motion sound and video and send it to my family members over the net.","I bought this camera while overseas in Macedonia. Since this is a once in a lifetime oppertunity, I bought a once in a lifetime camera. I love it. It seems to do everything but carry itself around. I recommend it for everyone  from non-experianced photographers to professionals.","Overall I've been super impressed with the results from this camera. It makes use of an HTML index of all photos or video recorded on a floppy diskette. The floppy disk as storage is one of the primary attractions in terms of getting digital images to the computer. It is also its greatest weakness. In the RAW image format (TIFF), the Mavica can store (1) image on a diskette. With a \"fine\" setting you will likely get storage of 20-22 JPEG compressed images on a single 1.4 MB diskette. Being a MAC and PC user I was very concerned about the PC format required for the floppy diskettes. But, I know most modern Power MAC's can format or read a diskette from a PC. The format of the photos (JPEG) is universal across most all platforms. The digital video output is limited to 60 seconds at the most modest resolution setting (approx 180 X 240 pixels.) Video output can be edited or viewed by Quicktime Pro for MAC or any MPEG-2-able video editor on the PC. The other setting for still photos will give the photographer a wide range of resolution choices for uses like e-mail or still photos with short accompanying sound tracks (also in MPEG-2.) As a professional photographer, I've been very happy with the photo-quality output from a variety of color printers (Apple and Epson). There are distinct limitations due to the .8 megapixel resolution, which really doesn't allow for much of an enlargement over 8\" X 10\". On top of that, your original image needs to be exposed correctly and should not require a lot of digital filtration or cleanup once it reaches the computer. The best original  yields the best results. On the whole, I've found the results to be a little below my desire for better output and higher resolution. This camera has maintained an excellent price resale level as a used camera, and the optical 14X zoom is one of the best around with top notch optical quality. The next model up with a Zeiss lens sells for several hundred dollars more and may be justified with Zeiss-quality optics and the option for Sony memory for storage in addition to the floppy disk. This camera does require a little setup to use, it is not a point and shoot camera. There's a white color balance option based on evaluating the hue of the incoming light through the white translucent lens cap- don't lose the lens cap! Overall this is one of the best digital cameras I've used in terms of color rendering. Perhaps one of its' strongest features is the camera's ability to achieve very life-like color and it does so without much muss and fuss. The Mavica FD-91 handles close-ups extremely well, even with the built-in flash. I found it lacking only in it's inability to trip an external flash unit with a hot shoe or synch plug. You have to rely on the built-in flash as the main light source and this becomes a real drain on the battery. By the way, purchase a couple of optional Lithium batteries; the NP-F550 is Sony's longest charged battery for this model to date. I also recommend getting a camera case for this model as a plastic, Kevlar reinforced body is no substitute for a bomb-proof metal body at half the weight. Without breaking the bank, originally this would have been considered as one of the nicer buy-ins of digital image creation technology. But, according to current standards (2004), it is considered expensive and lacking in the higher resolution that current cameras 1/5th of the price now incorporate. Currently, I could only recommend it for purchase as a used camera, provided you could get it for about a third of the orginal price when sold new.","This camera is TOPS for home use.  The pros might find a few things lacking, such as the limited flash intensity and inability to add an external flash.  The ONLY other draw back I have found it the length of  time it takes to save a pic.  It takes approximately 3-4 seconds for the  pic to save, so rapid fire shooting is out.  But, with the floppy drive,  and ultimately endless storage capacity (how many disks can you carry?)  makes this a tolerable drawback.  It is not in the megal pixel range, but  in the 1024x768 fine mode, I have found that the resolution is very good.  NOTHING beats the zoom on this thing.  14x zoom!  A toy that I will NEVER  get tired of using and playing with!","This is the best thing sence the toaster! I never had so much fun with a camera.  The possibilites are endless.  The photos are perfect.  I purchased the telephoto and wide angle lenz also. The stock battery life is  short so get the bigger extended life battery and you can shoot all day  long. I keep both batteries charged in my case and never worry about  battery life. Also recomend a good photography program such as photo suite  III. Best purchase I've made yet.  Go Sony!","A GREAT CAMERA. AMAZING HOW MANY THINGS THIS LITTLE BABY CAN DO.FLOPPY DISC STORAGE IS BY FAR THE BEST AND EASIEST WAY TO TAKE PHOTOS. A GREAT FEATURE IS THE ABILITY TO COPY A FLOPPY RIGHT INSIDE THE CAMERA TO GIVE TO  SOMEONE THAT WOULD LIKE YOUR PICTURES. THE ONLY SHORTCOMING OF THIS CAMEA  IS THAT THE RESOLUTION IS NOT UP TO 35MM FILM. BUT THE CONVIENCE FAR  OUTWEIGHTS THE CONS.","I love the telephoto feature and find it tops for nature and close up work. Also the anti-shake feature helps at maximum range. The ease and speed of transfering images to the computer is one of the best. However, I  find the lack of provision for a dedicated flash and the inadequate  in-camera flash to be puzzling in a camera of this price range. Interior  work is limited to 8 feet unless flood lights are used. This is definately  a good camera for outdoor work but not for interior shots.","I have had this camera for six months and still find it to be the best digitial camera available for the price. (Amazing in the computer world) Others have cameras with more pixels, more storage, etc., but no one has  matched the lens. a 14x (38mm-510mm) optical zoom is unmatched. Combine  that with the floppy storage (no easier method for transporting to multiple  computers) and the multiple viewfinders (LCD screen and eyepiece) and you  have an unbeatable combination.  The resolution is more than acceptable for  anything but professional use (and even for professional use online) and I  bet hardly anyone uses anything other than JPEG mode anyway. A real winner!  PS mine got stolen last night and I am ordering another even after  checking out all the newer models!","Sony has a habit of being just a little better then the competition and the FD91 is no exception when it comes to digital cameras. As a web designer by trade I was looking for something that would give me  professional looking photos. Have to say I haven't been disappointed. This  is an extremely easy camera to use and I love the floppies, no download  problems or issues, plus I can leave a copy with a client instantly. I  would highly recommend this camera to anyone that isn't turned off by the  price.","Got this camera for Christmas (am I lucky or what).  Great camera and pretty good resolution. The ability to use floppies is very convenient (and Apple thinks floppies are dead).  Easy to send an entire disc of pics to  relatives after copying them on my home computer.  And even easier to send  slideshows of pics as attachments to email.  Can also print out nice photos  on color printer without a problem. This is a great camera for taking  photos that you can do so many things with. Just wish floppy held more  data.... Now when Sony finally comes out with their high volume storage  disc (100MB), hope they will update this camera to hold THAT...I would buy  it in a second.","The two features that really stand out to me with the Mavica FD91 are the 14x optical zoom and the manual focus.  Those features make it into a very high quality camera.  I bought this camera thinking that it was an  advantage that it uses 3.5\" disks instead of memory cards but I now  think I would rather it use memory cards just because it would hold more  pictures and I wouldn't have to carry around stacks of disks.  That's not  too big of a problem though because the quality of the pictures are  fantastic.  I use this camera all the time and would recommend it to others  that don't mind that it uses 3.5\" disks.  If possible I would rate  this camera as about 4.7 stars but since its either a 4 or a 5 I gave it a  5 because it really is an excellent camera that deserves more than a 4.","I had earlier version Mavica but the FD-91 blows the others away.  As a construction estimator I use my camera every day.  This Sony camera is the best tool I have ever found for my estimating work.  The pictures are great  and the features cover every situation.  It is amazingly easy to whip up a  photo presentation with the excellent photos and included software.  I have  probably sold more of these cameras for Sony than their advertising  department.  I never go anywhere without my FD91!","I found it to be wonderful to use. Such good quality. I use it all the time. This is my first digital camera so when I found out what It could do I was thrilled. I love being able to erase badly taken pictures it's  amazing and now you can't really mess up taking pictures and the camera  won't either. I love photography, but now I love it even more. I love what  I can do with pictures on my computer.I hope everyone enjoys it as much as  I do. I want to learn more on the mavica photo printer fvp-1 $500.00 and  how to buy it. I can't find it on line. I got a paper on it that came with  my camera but the phone #'s busy. help!I really want it.Thank you. Tabitha  Gilling Bones26@earthlink.com"]},{"name":"Kodak DC210 plus","amazon_reviews":["This gives me a spare that I can use if another breaks down. Works very good. Thank You D...","As digital cameras with better resolution appear, the Kodak DC-210 seems perhaps outdated.  But it is not.  For pictures to insert into web pages, it is perfect.  The DC-210 has a large LCD for viewing photos, and a two to one optical zoom lens.  Using CF memory, getting pictures from the camera to your computer is very easy.  It even works on my Amiga 3000.  If there is any problem with the camera, it is the short battery life.  You will go through a lot of AA alkalines if you use the LCD much, but that is not a serious problem.  Just don't pay a whole lot for the DC-210, as new cameras in the 1.1 megapixel class are now under $100.","If you are looking for speed this is not your camera. I love it! I am more into quality of pictures rather than the speed I can take them. This camera lets you view every picture right after you take it and immediatly decide if you want ot keep it. I take all my pictures on the best quality and I think they are great! If you use the duracell ultra battery you shouldn't have a problem.","This is a 1.3 Mpix camera and is an excellent camera for this category.  It takes great pictures up to 4 X 6.  I have even printed out 8 X 10 that are very good.  Upon close scrutiny you would notice pixels at that resolution but that would be true for any camera of this calibre.  If you have a laptop and an adapter card for the memory card then downloading pictures is a breeze.  No Kodak software is even needed.  I do find the Kodak software useful for simple cropping and printing of pictures as well as slide show presentation.  It is slow to upload using serial port on a desktop and well worth buying an adapter that accepts compactflash cards.  I have taken thousands of pictures with the camera and feel it is well worth it for the category of camera it is.","This is a fantastic camera - I've had mine for over 12 months and have taken over 3000 pictures with it.  Never a problem and seldom a bad shot.<br />Don't listen to people grumbling about battery life.  Spend a  couple of dollars more and buy two sets of AA size Ni-Cad rechargable  batteries (8 in all) plus a charger, and you'll never think about the cost  of batteries again.  The carry case even comes with elastic holders to  carry the batteries in.<br />Great camera.  I recommend it.","This gives me a spare that I can use if another breaks down. Works very good. Thank You D...","As digital cameras with better resolution appear, the Kodak DC-210 seems perhaps outdated.  But it is not.  For pictures to insert into web pages, it is perfect.  The DC-210 has a large LCD for viewing photos, and a two to one optical zoom lens.  Using CF memory, getting pictures from the camera to your computer is very easy.  It even works on my Amiga 3000.  If there is any problem with the camera, it is the short battery life.  You will go through a lot of AA alkalines if you use the LCD much, but that is not a serious problem.  Just don't pay a whole lot for the DC-210, as new cameras in the 1.1 megapixel class are now under $100.","If you are looking for speed this is not your camera. I love it! I am more into quality of pictures rather than the speed I can take them. This camera lets you view every picture right after you take it and immediatly decide if you want ot keep it. I take all my pictures on the best quality and I think they are great! If you use the duracell ultra battery you shouldn't have a problem.","This is a 1.3 Mpix camera and is an excellent camera for this category.  It takes great pictures up to 4 X 6.  I have even printed out 8 X 10 that are very good.  Upon close scrutiny you would notice pixels at that resolution but that would be true for any camera of this calibre.  If you have a laptop and an adapter card for the memory card then downloading pictures is a breeze.  No Kodak software is even needed.  I do find the Kodak software useful for simple cropping and printing of pictures as well as slide show presentation.  It is slow to upload using serial port on a desktop and well worth buying an adapter that accepts compactflash cards.  I have taken thousands of pictures with the camera and feel it is well worth it for the category of camera it is.","This is a fantastic camera - I've had mine for over 12 months and have taken over 3000 pictures with it.  Never a problem and seldom a bad shot.<br />Don't listen to people grumbling about battery life.  Spend a  couple of dollars more and buy two sets of AA size Ni-Cad rechargable  batteries (8 in all) plus a charger, and you'll never think about the cost  of batteries again.  The carry case even comes with elastic holders to  carry the batteries in.<br />Great camera.  I recommend it.","I bought one of these camera's for my office about 2 years ago after reading reviews of various digital cameras in a computer magazine. It turned out to be a great buy. It is a very easy to use and takes pretty  good photos. I liked it so much, that I ended up buying one for  myself.<br />There are a couple of problems with this camera:<br />If you use  the LCD panel(for previewing pictures you have taken), your batteries (4  AAs) will be drained - FAST.<br />The 4 mg memory card that comes with this  camera is really not enough. I would recommend that anyone buying this  camera buy the 32mg chip. With 32mg, (and the 4mg card) you can take more  about 130-140 photos at the highest resolution (the recommended resolution  if you want to print your photos). This makes the camera great to take on  vacations - you don't have to worry about running out of memory.<br />It takes  a long time to transfer photos to a computer. I recommend getting the  Parallel Picture Card Reader (from Kodak) which will make the photo  transfer lots faster.<br />Buying these various accessories does add to the  cost of the camera, but it is well worth it.<br />The print quality of these  pictures is pretty good (although NOT regular photo quality).  You can  upload your photos to Kodak and they will print them and send them to you  through the mail.  Also, they will set up a URL where your friends and  family can see and order your uploaded photos.<br />As much as I love this  camera, I think that I will eventually buy a higher end version (maybe the  Kodak 260) so that I can have better print quality for my photos.","The camera's software is incredible, this is a definite upgrade over the sony mavica. Pictures are crisp and clear, especially when using the high res flashpix mode. Only gripe about the caamera is battery life. Expect  about 8 hours from a set of four. I found turning off the auto preview  helps. They also sell some great Ni-Mh rechargeables that last about twice  as long. Overall a great camera...","I purchased this camera for two reasons a) to save money on film and development cost and b) to support several imaging related projects I'm working on - namely a picture CD, printing and framing photos, digital  collages, etc.  For the money spent (~$450 after add-ons) it was well worth  it.  The image quality is great, and the pixel density is good enough for a  decent 5x7.  On the down side, PC transfer is pretty slow - about 45  seconds per image on the highest quality and size.  Also, the picture is  ideal when the subject is relatively close - like between 4 and 20 feet.  Beyond that the results are not optimal.  Overall I'd say if you want a  digital point and shoot camera to replace your film camera, this is the  one.  If you are an amateur photographer, go for a DC260 or DC295.","I actually got the DC200 camera as a Christmas gift this past year.  I have taken over 500 pictures and have put photos on the web, sent them to family, and even recorded photos on video via a VCR.  You can also view  photos on your TV!  The DC210 Plus has additional 2x zoom capability and I  believe better memory usage and battery life.  My only complaint is that  they eat batteries. I bought the adapter for $80.00 and use that for  downloading and viewing on video.","In trying to keep up with technology in high school, as yearbook adviser I went looking for ways to make doing layouts easier and more fun. The Kodak DC 210 is the perfect camera for my kids. It is easy to use, easy to  transfer pictures to the computer, and a breeze for them to do special  effects.<br />The pictures actually print in the book extremely well. We had  an 8x10 photo on one page and no one could tell it was digital. The photo  won first place in state contest!<br />This camera is well worth the money!","My Dad got me this camera so that our family could easily send photos home of our son (and us a I guess ;)  We've since replaced our film-based camera  primarily with this one.  We have and Epson Stylus 800 printer (highly  recommended), and we can print photos of comparable quality to normal  film-developed photos.<br />The camera has a really nice user interface for  setting the camera configurations, viewing stored photos, transfering  photos to a PC, and deleting photos from the camera.  It is compact and  easy to use.  It also has a few nice features like a timer, and closeup  modes.<br />The only drawbacks are, it doesn't take shots that require a  telephoto lens very well.  For example, I've tried to take a simple picture  of Mt. Ranier, a huge/stunning mountain visible from most anywhere near  where we live, and none of them turned out too well.  It also takes a while  to download onto the computer (for highest resolution photos it's about  18/10-15 minutes)  If you have a laptop I suggest you get the Flash card  PCMCIA adapter.  It allows you to get the pictures off the Flash card  lightnight fast.<br />If you're looking for a good digital camera that could  replace your film camera this is a great candidate despite the flaws."]}]