[{"name":"Canon PowerShot 350","amazon_reviews":["Great product.  Worked perfectly.","Works great with my 60D","Better than expected!!! really like this gadget!!!","Works perfectly for my Canon T3i.","Just what I needed","This works like a charm for my Canon 60D. The directions were poorly translated to English but it was fairly simple to figure out. I love the variety of options for shooting (single, burst, delay, bulb)","I ordered one of these for my husband and it worked quite well; but after 2.5 years, it just quit.  I'm ordering another one, but feel it should have lasted longer.","Works fine with my Canon G16. I've gotten up to as much as 60 ft range - but haven't tried it further than that. I have only used the single shot mode. The receiver piece has a false hot shoe with no metallic contacts - but when I screw it into the hot shoe - it disables my onboard flash. HUH?????","Great product and service","Great product.  Worked perfectly.","Works great with my 60D","Better than expected!!! really like this gadget!!!","Works perfectly for my Canon T3i.","Just what I needed","This works like a charm for my Canon 60D. The directions were poorly translated to English but it was fairly simple to figure out. I love the variety of options for shooting (single, burst, delay, bulb)","I ordered one of these for my husband and it worked quite well; but after 2.5 years, it just quit.  I'm ordering another one, but feel it should have lasted longer.","Works fine with my Canon G16. I've gotten up to as much as 60 ft range - but haven't tried it further than that. I have only used the single shot mode. The receiver piece has a false hot shoe with no metallic contacts - but when I screw it into the hot shoe - it disables my onboard flash. HUH?????","Great product and service","Just works. I've taken 1000s of pictures on my Canon 60D with this wireless shutter release. I has good battery life, but I would recommend removed 1 battery from each part when not in use. It's fairly for them to turn on while in your bag, leaving you juiceless when you need it most","This has really been a useful item for me since I am older and can no longer hold the camera very steady.  I use the tripod whenever possible.  This is especially useful for late afternoon, evening, and night photography.  Especially astro photography.  Very happy with it overall.","Loved this!","Update 03/27/2016:<br />I’m still using this wireless shutter release and everything is still working great after two years. Now I have it on my camera bag all the time and use it whenever I use my tripod (low light, macro photography, HDR, etc). The button on the remote control works just like the one on your camera (half press to focus, press all the way down to take the picture). It has been really useful when we were shooting in really cold weather and I could keep my hands in my pockets and use the remote control to trigger. It also has helped when you are watching for that perfect shot to happen, set it up, and wait nearby… you don’t have to be right next to your camera/tripod. The batteries last a long time as well, I’ve left it on by mistake and the batteries were still working after that. Still five stars!<br /><br />Original review below 11/20/2015:<br />I have been using this wireless shutter remote control for almost a year and I love it! It's easy to set up and you don't have to worry about tripping on cables! It comes really useful especially for night photography and light painting photography. You can walk away from your camera to \"paint\" and take your pictures, you don't have to keep coming back to the camera for every sequence.","Works great and has good range.","Works as they should. Comes with what you need to deal with pro and prosumer camera connections (3 pin vs 2.5mm). Works well. It's cheaply made (plastic). But it makes remote triggering of a camera super easy. The transmitter seems to work well from 20+ feet away too quite well. No problems so far. Well worth it's low cost.","Got this for taking photos of hummingbirds and the moon with my Canon SX50. My arm would get so tired sitting still in a chair, reaching up to the tripod to hit the shutter button and anyway I was causing the camera to move. This remedied all of that. Very happy with this product.","This really stinks because this one works on frequencies (so it works over long range) but it doesn't start and stop video recording.  This model only works for the shutter.  Which I would have known had I read the listing thoroughly.  However, the ones that do start and stop video recording are infrared and require line of sight to operate.  I feel a little bit duped here.  What I want and need remains elusive.","As someone who mainly photographs city skylines and my friends and family every now and then, i needed a shutter release that would meet the following criteria i had set forth.<br /><br />1. it would work from any angle (front of camera, back of camera, either side of camera)<br />2. it had a decent range, i did not want to be tethered to my camera so it had to be wireless<br /><br />After searching all over for a good remote shutter release i ended up coming to this one. This shutter release is hands down fantastic! I can release the shutter from any angle with no problems and it has great range too! I was able to release the shutter in my house 1 room away behind a wall, outdoors i can get pretty far away from my camera and easily take pictures. If you need to be conspicuous / want to get organic shots without seeming like you're waiting for the right moment behind your camera then this will do it.<br /><br />It has different modes on it for single shooting, bulb mode, rapid shooting, and continues. I honestly cant find any cons with this Shutter release, do yourself a favor and buy it!","This is my second one. Performs perfectly every time. Highly recommend!","Absolutely love this remote. It has a great sensor and I've even dropped it into a lake once. I took it home and put it in rice and voila! Still works. Slight issue with getting the wheel that affixes to hot shoe mount to stay tight enough so occasionally it falls off. Not too bad an issue that I would list that as a fault, probably more that I just don't have great hand strength. When and if this one wears out, I would definitely repurchase this one - the price is right and it's a fantastic addition to my camera bag.","This is an early review--If I have a maintenance or robustness problem with the product later, I'll add more information.<br /><br />The pixel unit arrived fully functional, working well with no problems.  Everything was included to begin operating immediately.  The included batteries appeared to be ordinary carbon-zinc rather than alkalines.  They were functional, but I swapped them out immediately for non-rechargeable lithium batteries, which will hopefully last for an extremely long time in these units.<br /><br />The shutter release options switch worked fine, although option selection is rather ambiguous.  The click positions of the switch are close to one another and feel rather mushy without a clear visual index.  With my thick fingers, I have to count clicks carefully.  If I actually had to change the options frequently, this would be an annoyance.<br /><br />There is no power switch on the transmitter--this is not normally a problem as that it's only on when the shutter release is depressed.  But there's also no \"lockout\" position, so take care when packing it.<br /><br />The bodies of the units are molded plastic, well-produced, well-fitting.  The only build issue was that the shutter release buttons on both units fit loosely and clatter a bit.  This does not appear to matter operationally, but it would be more comforting if they were more strongly spring-loaded to prevent that.<br /><br />Another slight problem was that the transmitter's battery compartment was really tight--I needed to use a small knife blade to get it open.  But if the reputed battery life proves out, that's not something I should have to do often, and it does mean that the door isn't likely to pop off accidently.  OTOH, if you work in an area that requires removing the door to make frequency changes often, it could be an annoyance.<br /><br />I cycled the system through several frequency changes, and found they worked well with nothing in my fairly frequency-crowded computer room causing interference.  I did not check for maximum range, but I did verify that it worked through a couple of interior walls.  Inasmuch as the transmitter does not have an external antenna, this was a good thing.<br /><br />I've used a couple of other inexpensive Chinese-made radio remotes before, and this is an improvement of concept in a couple of ways.<br /><br />One is the periodic flashing LED on the receiver.  In my previous units, I've frequently packed them away forgetting to turn off the receiver--I expect that not to happen with this periodic flashing LED.  I also appreciate the transmitter's internal antenna.<br /><br />Having an interchangeable cord on the receiver rather than a fixed cord is a good thing.  Frankly, the only reason I bought this unit is because I changed cameras and my previous unit has a fixed cord...it's much better to only need to change cords.  Although the 2.5mm cable isn't as common as 3.5mm, you can also find longer third-party replacement cables.  (But the choice of 2.5mm is Canon's peculiarity, not Pixel's.)<br /><br />My previous unit also used harder-to-find button and camera batteries rather than common AAA cells.  This is another small thing that is really a big thing (even if it does require a slightly larger receiver).<br /><br />I don't know how well this unit will do over time or with a bit of normal abuse--I use remote releases a lot, so I'll buy another just in case I drop this one and then step on it.  But at the price, buying a spare is not a deal-breaker (and my motto is \"everything essential must be redundant.\"","Works well on my Pany G5.  the small plug must be pressed into the camera with some force until you feel it click but, the remote works like a  charm.","Good product! Super fast shipping.","These work really well. Great deal at any price.","Remote works great.  Not line of sight, can use from any direction and LONG distance.  I haven't tried the full 100 yards but you got to buy this one if your camera has a port.  Works on Canon SX50 hs.  Great for wildlife and for those camera-shy people who suspect nothing.  Bought another for a gift for a friend.  Tremendous value.","Awesome product! Good Price also! Easy to use.","I have bought 2 of these guys to use with both cameras.  Been using the first one for over a year and it has never failed me! Quick, responsive, and reliable.","I really like the concept and the price; however, the unit is a bit finicky.  I haven't missed getting a picture, but sometimes it takes a few tries.  That said, I like it and would recommend it to any one on a budget.","for the price, it works. i just treat it with special care because it definitely feels cheap. but i functions properly at this point in time. had it roughly a month now","Livraison rapide","Perfect. I can easily take family photos with me in the photo. The remote works so well I can have my hand hidden behind everyone so no need to photoshop my hand out like with my previous cheap remove that needed a direct line from remote to camera. Love to also use this if using a tripod in low light for my clients photo shoots.","Best value for the money...do not waste your mobey for the brand one","Works with my Rebel and 60D.","Works exactly as you would think. Plug and play design.","I've only used it a  few times and the coating on the wire broke where it is connected.","AND I CAN BE THE M/SUBJECT","Works great.. Handy little gadget !","Shutter works great. It was for my husband so I don't know a lot about it.","This Item is for a Christmas gift will not know till then!","it really works, its very easy to set it up. and  do everything as they say. The only bad thing is that the seller says that the batteries are included, and thats a loe. it came with NO BATTERIES ITS A LIE, THEY WERE NOT INCLUDE.","It does what it says! All you need is included. Just make sure the switches (inside of the transmitter and receiver) are set to the same order.","This remote turned taking pictures from tripod into my favorite process. One thing is related to Pentax K5IIs: supplied cable is too short and from time to time it disengaged from the camera. I bought coiled \"Camera Remote Control Shutter Release Cable Cord 2.5mm to RS-C1 Black for Canon\" for a couple of dollars and it completely solved this issue. My major complaint is that even when not in use, both receiver and transmitter drain batteries and a couple times I was caught in field with dead batteries. Intermediate solution is to use remote as wired and to push a large button on receiver to take pictures.","works great!!!!  came in handy for the family photos.  much better than just using the timer.  if mounted on flash shoe, blocks the built in flash, so I leave it hanging by the cord.","Good product","Have looked for some time for an easy to use and Compact remote for our Family Adventures. Now I can be part of the action and not just the Photographer as I have been for years. Working by Radio rather than IR line of sight the possible uses are unlimited for so many photo opportunities.","It perfectly works with my canon 1100 D product. I like it. It comes with assitional cable for canon rebel EOS .","I ordered this product which was shipped from China. Reached on time and I am happy to have it. Well packed with all required items works perfect. The range is amazing also you don't need to point exactly towards camera to trigger the shot. Small in size and above all works on comfortable AAA batteries ... having all the modes described.","These work very well and fire every time. No headaches, just plain and simple.<br /><br />One thing to note is that the \"sender\" remote does not have a power on/off button. So if the release button is accidentally pressed while in your camera bag, it was draw power and drain your battery. The \"receiver\" unit, does have a power on/off switch, so not a problem there.<br /><br />After about 1 year, my \"sender\" remote no longer works, but the \"receiver\" is still good.","Works as described, at least at 30 feet distance. Well worth the money. I am so glad I purchased this.","I bought this for my fiancee for Christmas last year and she is getting a lot of use out of it.","This remote/receiver does work with a Canon DSLR 650D.<br />For single shooting it works fine and the distance is pretty good.<br />For the other settings it is a little complicated until you get good practice. You have a 1/2 press button that allows you to focus without taking a photo which is a great feature.  You need AAA batteries for both the remote and receiver so that is 6 batteries total.","As long as you remember to set it up correctly, this is an amazing product!<br /><br />I forgot about the small cord to connect the part that hooks to the hot shoe to the camera and got very frustrated one day.  I thought I was doing something wrong, but I figured it out and it was perfect.<br /><br />I was able to stand up to 150 feet away and still receive a 'signal' to snap pictures, even through walls.  You can take one or 10 pictures, which is great when you're trying to capture special moments that might not occur if you were actually in the room.  For example, I have some adorable photos of my goddaughter playing in her play room, when she didn't know I was snapping, because I was standing upstairs, pushing the button.  Totally worth it!","This is inexpensive, but I have tested it and I can be over 50' away from the camera and it still works. easy to mount and easy to use.","This item is useful to avoid jitter when operating the shutter with the camera on a tripod at full zoom.  Also useful alternative to self timer for group shots with the camera operator in the group.  It is a bit bulky, but you can shift it around, or just let it dangle from cord if it gets in the way.","Super Cheap and super good! - works perfectly as advertised.","I use it on my Canon SX50 and it works great.  I like that you can push half way down and it will auto focus and then push down to take the picture.  Comes in handy for family pictures with no one around to take it, especially outside ones because it uses the flash connection.","This wireless remote allows you to step out of the picture or into the picture when a remote cord is not long enough or the camera timer is not convenient. I use this remote when I photograph birds. I set up the camera, retreat to an inconspicuous spot, and then trigger the camera with this rermote when the birds show up. Also works great for timed exposures for a no touch solution to firing the shutter.<br /><br />This remote seems to be of good quality. So far In moderate use, including the occasional drop, I have not experienced any problems with its durability. This remote allows channel discrimination, where each remote can be set to separate channels. Aother real plus is that it uses readily available AAA batteries.<br /><br />I liked this remote so much, I bought a second one for my second camera.","Worked perfectly, just as expected<br />I'm usually cautious about purchasing third party items,but this device fit the bill. No problems at all,thanks","I had never used a wireless shutter remote before.  It was a little complicated to figure out at first, but I found a youtube video that clearly demonstrates how to set it up.  Once you get it going, it's so simple!  I can't believe I waited so long to get one.  We had our whole family coming home for the holidays and I wanted to be in the picture too!  Perfect!  and such a good value. I can't imagine it working any better.  Would definitely buy again!","Worked as claimed but I had trouble initially.  Don't follow the instructions in the EOS 70D manual for the Canon wireless remote which calls for setting the Drive to Self Timer.  You need to set it to anything else to make use of all 4 modes of the wireless.  I haven't tried to see what the maximum range is.","Bought this for my Canon SX50HS. This thing works super and is a great value for the money! Buy one now!","i got this to use with my canon EOS60D. it works like it says except there's no way to get it to remotely start recording video, which is really what i wanted it for. just make sure you read the instructions and place the batteries in right. doesn't feel that solidly built but i've yet to have trouble using it.","I've read some not-so-good reviews on this, but I haven't had any problems with mine!  I've used it on several different occasions and in different environments and have had success each time.  I've used it when the sun is clear and bright and during meteor showers at 3am, to take family pictures and have used it upwards of 100 yards away with absolutely no problem. I've also worked with the burst setting, bulb setting and single image setting on the remote and it communicates with my Canon 60D perfectly.<br /><br />Others did point out that the battery does go in the opposite way that it normally would, but it still works just fine, so no problem there.  I'm only giving it 4 stars because the back battery compartment case is very very loose, so I am worried I may lose that at some point.","I was really impressed!  It even does the half-push to focus the camera.  Really works great. I didn't expect it to have the ablity to do the half press of the shutter release button.","This has been working realy good. I use it to take pictures of deer at night from my porch. It works great from a distance of 20 feet. I've had it for 4 months now and still working great.","This remote control works perfectly for my Canon SX50-HS. We used it for \"selfies\" and for long exposure shots. Very pleased with this.","This wireless remote is far better than the first one I ordered.  At 2.4 Ghz the signal between units allows me to be a greater distance from the camera and it works every time.  Very nice device to have when I want to be in the picture or like the pros allows me to snap images without touching the shutter button on the camera.","To all the reviewers. The remotes stop working not because of the remote but your camera. When the camera goes to sleep the remote cannot wake the camera. This is a very annoying glitch with the camera. You have to go up to the camera and wake it by pressing the shutter button slightly or halfway to wake the camera. After that it works fine if you use it but if you don't take a shot for a little while and the camera goes to sleep you got to repeat the step again the other thing is not to let your camera go to sleep or increase the sleep timer. I don't have this remote but hit the same problem with the infra red remote. The remote won't wake the camera. In my belief and don't quote me on this for i have not try it yet. If you get a remote that attaches to your hot shoe and runs a cable to shutter release may be a better solution. The cable release I use wakes the camera. I think those remotes are in the 100s but they also control off camera flash. So they are worth the price.","Light wasn't working on receiver and wouldn't trigger via remote but would by pushing the shutter button on the receiver.<br /><br />I read another review that said to check the polarity of the batteries and sure enough I just had to flip a battery and it worked.<br /><br />We'll see how long it last but so far it works great.","I first read the reviews before deciding to which one to purchase and I'm very happy I did.  I found this one to be one most liked and it turns out they're right. It's a great price for all it does. It comes with the batteries (regular ones and not the tiny, expensive kind).  The remote will literally work even in the next room with walls in between.  There are many options for shooting and it was so easy to figure out.  I highly recommend this one.  I purchased it for my Canon EOS 1000D.","This works great with my Canon SX 50. I've ordered gizmos and attachments for little pocket cameras that never seem to fit or work as described. I just got the Canon and so was looking for accessories. This automated system is great! You slide the piece with the cable into the hot shoe and plug the cable in at the side of the camera and viola...wireless photography! There are other options that I've not explored yet like starting video recording...I can hardly wait to get out and take more zoomed pics!","I purchased this based on another reviewer's excellent review and their Youtube contribution. Many reviews don't state the type of camera they purchased this device for. I have the Canon T4i.<br /><br />I didn't get to unbox it - husband did that for me and it was waiting when I got home. It mounts to the hot shoe easily, but if you have a low light situation requiring a mounted flash, I would recommend letting the receiver dangle, or even better ...a strip of Velcro to attach it as it will make it more secure and keep the receiver from coming away from the cord. It still works without being mounted to the hot shoe.<br /><br />The wireless remote is fantastic. No line of sight is needed, unlike the branded wireless remote (which was the primary reason I never got one). I know there are many products that are reported to be better and have more functions, but this will suit my purpose for personal family portraits (without the 2 second dash and the hope you're all in position) and it fit my budget. I love the fact that I can hide the remote and still take the photo. A half depress on the shutter function will focus the camera and a full depression will take the shot.<br /><br />Another reviewer mentioned there was no way to turn the remote off, so I simply remove the two AAA batteries to ensure they're not used up by mistake.<br /><br />A big selling point was you can get regular batteries that you can use in multiple devices and not proprietary. This makes the batteries easier to source as rechargable and no doubt a lot cheaper.","Used it on vacation for many different occasions. It was perfectly compatible with my Canon Rebel T2i. Didn't have to change the batteries the whole trip.<br />I did get the button stuck once, but I was jumping and trying to catch an action shot so I probably pressed the button too hard. I got it un-stuck and it worked perfectly normal after that. So because it was user error, this product still get's 5 stars.","This wireless shutter remote control works without a flaw from my uses so far. I just wish I could put it somewhere else on the camera with a strap or something, I use a speedlite that usually sits on the hot shoe of my camera, and since the receiver doesn't exactly \"need\" to sit on the hot shoe I could leave it dangling by its cable, but it just doesn't look as nice. I supposed I can buy an L Bracket to attach to the camera and this would be solved so it isn't that big an inconvenience especially if you don't plan to have anything else on the hot shoe. The distance on this remote is really good, plentiful enough for all the times I have used it so far. Durability seems ok and it hasn't lagged so that's good. Batteries are included, but plan on buying some more for when they die.<br /><br />Overall I rate this product 4 stars out of 5 stars!<br /><br />I hope this review has helped you out!","Range. That is the key here. I had previously purchased a \"stock\" (knockoff stock) remote. The range was horrible. I could only snap photos about 5-7 feet from the camera.<br /><br />Pixel Pro's 100M wireless shutter blows that range out of the water. I have definitely snapped from 20-30 feet with no issue. This is key when setting a tripod up where some critters/birds may fly away at the sight of a person. It also really helps when taking family photos. There is nothing worse than lining up a shot then realizing that you remote is out of range, only to either set a 10 second delay or reposition the camera. This situation has never presented itself to me while using the Pixel Pro.<br /><br />Like my review? Click like below and support the individuals that take the time to write personalized reviews. Be cautious of purchased reviewers trying to make products seem better or worse than they really are. We are entering an age where reviews can command a market. A better reviewers community will help weed out the cons.<br /><br />Cheers!","I read the reviews on this item and was considering not ordering due to the possibility of the cord not being a match. After some checking with my camera manual, ( a Canon EOS 60D), I decided to take a chance. It worked right out of the box, but the instructions were written in what can best be described as Chinese Pidgin English. Still, the pictures were sufficient to get up and running. It worked as described and required no finagling for use! My main use will be to take photos of the many and varied birds in our backyard paradise. We have Hummingbirds, Robins, Mourning Doves, Common Grackles, Woodpeckers, Sparrows, Finches, Cardinals, Bluejays and more. We also have several pairs of Golden Eagles which visit on a near daily basis. We have a huge deck in several sections, and deer from a nearby nature preserve come up on our deck even when we are sitting on it! One even tried to walk through the sliding door screen and into our four season family room. We had to shoo it away, and it was not happy to be thus excluded from our movie choice for the evening!  In short, the photo opportunities are nearly endless!<br />This wireless remote does what the blurb promises, and was very inexpensive. I also like that it's wireless and not infrared, thereby not requiring me to point it at the front of my camera. Once my camera was on the tripod and focused on the desired feeders, I simply sat in a comfortable chair and pushed the button to take the photo! It doesn't get any easier than this! Don't know if it works with all the Canon cameras listed, but it certainly worked seamlessly with my Canon EOS 60D, as advertised.<br />I don't think you can go wrong with this wireless remote. It is much more useable and multi featured than Canon's offerings.<br />Unkei","This remote system seems to work fine on my G1X.  It feels a little \"cheap\" in the hand but does the basic bulb-mode and shutter release modes it describes.<br /><br />I likely will be upgrading as I get some more flash-equipment to a remote flash triggering system but for anyone who knows what that means, you'll understand that those systems are MUCH more elaborate and for that reason, more expensive.<br /><br />This is a decent basic remote trigger.","I almost returned this because it wouldn't turn on.  Luckily, I read another review which said to move all the switches in the battery compartments in both units to on.  No problems now, and it works great!  Well worth the price.","It's easy to use, it does exactly what it says and the range is great. The plastic is a little cheap feeling, especially next to expensive camera equipment, but for the price you can't beat it!","i connected to my Canon 1000D and it works without any problem. The instruction are not the best but if you are familiar with the photography , is ok.","Great remove control... I tested and I love it... with his modes, you can take 1 or a series of photos on a blink!!!","Received it today and tried it right away. The cord pictured is not the one shown in the picture. No big deal though. It worked right out of the box. Pretty self explanatory even with the poor instructions. True it does keep the flash from popping up when attached to the shoe so ill let it hang or fasten it to the strap. If you want a cheap Radio Frequency (not IR) then this one will do just fine. I think I'll keep the batteries out for now until I see how it performs. If I have any problems ill update. So far I'm pleased.","Very simple to use (and it's a good thing because the instructions are pathetic). Tried this out with my Canon T3i this weekend and it worked perfectly out to about 75 yrds (approx.70 m.). Haven't tried it beyond that range yet, but I will. Also very handy for longer exposures where manual shutter operation might cause blurring. The only feature that would make this better would be the ability to start/stop the video record feature on the camera.","The remote was packaged new and arrived when promised. It is easy to use and works as described great for setting up a shot from about 10 ft from the camera.","I had very modest expectations for this.  I already own the Canon RC-6 remote, but because it uses Infra-red, it has very limited distance and you have to point it at the camera itself, so I wanted a radio based alternative.<br /><br />This unit was one of the only ones that uses AAA batteries for both the transmitter AND the receiver.  This is very important to me because there is nothing worse than having a proprietary battery run out when you need it most.  So, all I need to do is keep some AAA batteries in my bag.  So far, I'm still using the first set, but I love the piece of mind it gives me knowing I'll never be stuck.<br /><br />Also, what I discovered was that on a Canon T4i, the remote doesn't start and stop the video... but it does something even better, it makes the camera re-focus.  This is huge for making videos where I am both subject and photographer.  Now, I can stand in front of the camera, and just hit the remote to make sure I'm in focus.<br /><br />Because this uses wireless radio... it has much bigger range than the RC-6.<br /><br />For those curious about the remote focus... I posted a video demonstrating the remote focus hack on YouTube.","wasn't expecting this to work so well! very happy that it works as promised. the RF is a must. used it extensively on our first vacation. easy to set up and take down.","I do out door photography. Most of the time I'm by myself. This little remote shutter release has saved me countless steps.<br />It is delicate and can't be banged around BUT any one who is that careless with there camera gear should change professions.","Works well, looks good, and its plenty cheaper than a lot of alternatives.<br /><br />- The trigger button on the remote is a little wobbly, but otherwise the whole setup is pretty solid.<br />- The cold shoe on the receiver has a twist lock to tighten it down and prevent it rattling with movement or wind.<br />- The shoe isn't necessary for use -- you can leave the receiver dangling.<br />- There are 16 radio frequencies to choose from, set by 4 small toggle switches (like a garage door opener) in each battery compartment.<br />- You could in theory trigger hundreds of cameras simultaneously with a single transmitter if you uses the same frequency across all the receivers.<br />- The trigger button is two-stage, half-way to focus, full to shutter. Be sure the cable between the camera and receiver is fully plugged in or the focus feature won't work.<br />- The receiver has an on/off button and the transmitter doesn't use power unless in use (like waiting in bulb mode for the close shutter press).","I take a lot of self-photos because I lack willing victims for my home studio practice, but it's hard as hell to focus at arm's length, especially when using a prime lens with a longer minimum focusing distance. I was looking for a compatible trigger for my EOS 60D without breaking the bank, but with a few more features than the simple IR trigger, or a wired one.<br /><br />This one fit the bill. To start with, the expected shipping date shocked me as it was expected to take 3-4 weeks to arrive. I was a little bummed at the perceived wait time, and the tracking didn't cover anything but the departure scan. That said, in under 2 weeks the package was at my door. A pleasant surprise!<br /><br />In my excitement I pretty much tore open the box, jammed in some AAA batteries and just plugged it all in. There are instructions but for all intents and purposes this is a plug and play item. There's no need to mess with camera settings or anything of the like. Simply turn on the receiver and start mashing the remote control button for snaps. Easy!<br /><br />As mentioned in other reviews, the receiver has a cold shoe mount that enables you to mount it on top of the camera. You slide it on and then tighten it with a little dial so it doesn't slide back off the mount. I really like this feature as it keeps it safe and out of the way, but of course if you are using a trigger for strobes or a speedlite, you will need to remove it. It can dangle from it's cord, and it's fairly light so it doesn't pull overmuch; however, I would recommend finding a way to secure it to the camera body or tripod to prevent unnecessary wear and tear on the cord.<br /><br />Half-press the shutter button to focus, then hold it all the way down to trigger the camera. This was definitely a deciding factor for purchasing this product as focusing was an issue for me beforehand. There's also a timed release and a bulb setting. The last one in particular was a feature I liked for my longer exposure photos that I was doing manually before and praying I wouldn't bump the tripod in the process.<br /><br />Another reviewer mentioned the cord didn't fit his EOS 60D; this nearly made me pass up purchasing this trigger set. However, I was glad I took the plunge. I'm not sure if it was a slightly different trigger set that he got, but I received a cord that fit my 60D without issue - standard little plugs on both ends, a simple wire (not the coiled one in the product photo). In the end, I did not have to purchase a separate cord. Phew.<br /><br />All in all, for the money - you can't lose. Great product, and I'm glad I took the plunge!","I've not used it for a remote strobe, but as a remote shutter release, I've used it up to 100' away without any problems at all.<br /><br />Great product for the price!","I bought this at a whim and I have no regrets. I needed a remote and having one that was wireless was a plus. You can also use the receiver as a regular wired remote as well.","This works as advertised. I have not went out to 100M, but have got it to work at 50M with no problems.","My new Canon EOS 60D uses a 2.5mm jack for the remote shutter release. It comes with a cable for other cameras (the camera end looks like a mini USB - It's not- but that's what it looks like).  So I bought a \"3ft 2.5mm Stereo Plug/Plug Male/Male Cable - Black\" for a few bucks and now can connect it - and it works.<br /><br />The instructions are minimal, to say the least, and I had to play around a little to get certain things to work, like, the \"Multiple Shots\" setting in \"Sports Mode\".  With the transmitter on \"Multiple Shots\" mode it takes two shots pauses then takes two more shots etc. But with the transmitter in \"Bulb\" mode you press the button once to start rapid shooting and again to stop it, but it doesn't pause.<br /><br />I bought this because of \"Bulb\" mode and the range. \"Bulb\" works and the range is quite good 35'+ throughout the house etc.  Seems solid enough.<br />Just know you may need a different cable for your camera.","It works well.  I used in my photo booth, hand the customer the remote and let them press the button and boom goes the camera.  Tons of fun.","This is a great remote.  I'm using it with my Canon EOS 60D, and it just works.  I especially like the ability to do a half press to focus.","This remote just works.  You plug it into the camera, and you have a completely wireless solution.  I thought about getting the Canon IR remote, but there are times when you want a remote that doesn't have to point at the camera.  The thing that really persuaded me to get this one was that you can do the half button press to get the camera to focus.  That is invaluable when taking self portraits.","I've used a number of remotes with my Canon T3i & 60D, but this Pixel Pro is undoubtedly the best. The fact that it's wireless, uses AAA batteries (not some other weird type), very good range (easily works through walls), nicely built & reasonably priced make it my favorite. If I'd found this remote first I wouldn't have a drawer full of others that I no longer need.<br /><br />---Update 7/6/2013--- After using this remote for some time now, I'm even more satisfied with its performance. The battery life is phenomenal. I'm still on the first set of batteries. Admittedly I don't use the remote every day, but many other devices I own would've drained them whether in use or not.<br /><br />The multi use feature has impressed me as well, since I've recently picked up a 7D and a 5D III. They have a different remote jack & require an N3 plug, I thought I'd have to buy another remote. Not so, this remote can be used with many different cameras with different plugs, just by buying only the cable needed for that camera. It's not just saving a few bucks on gear, you don't have the extra hardware to store or carry. As I said, I'm even happier with this item thanhen first purchased.","Ordered this for my mother because she has a Canon 60D, which we both share, on Dec. 22, 2012. Got it on the 2nd of Jan. Came more than two weeks early, so great delivery for that. When we received it, and opened the package the control that goes on top of the camera, and hooks up to it looked a little worn like it was previously used, but that was no biggy. When putting the batteries in, one of the springs makes it difficult to get it, but again, simple fix, and it still worked once we got it in with the help of my brother. Working wise, it has worked so far, only a couple things were a little... confusing with the settings. Some won't work on certain settings with the remote, but it would on the camera without the remote; kinda odd. Anyhow, aside from that it's worked well so far. I got it for $20 at the time I believe. Another downside to it, is that the receiver connects onto the flash mount, which kinda sucks, but can also be dealt with easily. We don't have a flash to mount on there yet, but I'm sure when we do, it may become a small problem. I would MAYBE buy from this place again. Maybe not.","It works great!  Only suggestion would be to remove batteries from the transmitter once you're done since the shutter release button can easily be pressed when not in use.","Does just what it says. Only used it a few times, but like that I can use the remote from other angles instead of straight on like the light beam triggers.","I purchased this remote shutter release for use with my Rebel XT (350D) and it does a super job!  I use it for remote trigger on my camera that is mounted on my telescope for deep space images.  Any walking around the tripod during exposure sends vibrations thru the scope and the images show the evidence.  With this release, I can be far away (even inside the house on cold nights) and trigger the shutter!  The shots are amazing!  Even figured out that when using the Mirror Lockup feature in Manual Mode on BULB the first press locks the mirror out of the way, the second press opens the shutter, and the third press closes the shutter.  No more mirror vibration in the 5-15 minute exposures! This is a nice product from DigiKit that does everything it is supposed to!","This remote shutter release does what it was designed to.  I use this for night time photography along with a remote flash system. It allows you to create some amazing photo effects.. Include yourself in photos easily.  The transmitter and receiver are well made and use standard AAA batteries that last a long time.  I highly recommend this remote release set.<br /><br />Pros<br />Compact<br />Uses standard AAA batteries<br />LEDs show unit is on and change color when triggered<br /><br />Cons<br />Make sure you order with the proper cable for your camera -There are different models","I've tried other remote controls for my cameras before, but found them unreliable. This one works so well that it makes taking photos of myself or group photos of my family easy. I like that you can do test shots to get the settings right while the device is on the camera. Then, it's a snap to use the remote. Glad I bought it.","Hesistant at first but wasn't wrong about it. Very responsive I mean the sync is fast enough and the build quality is superb. Never tried those expensive ones but for me this is exactly what I needed for my Canon 60D. I never tried 100 meters but i think it will do.","I am one of those unfortunate souls who is always looking for one more feature that my current technology acquisition is missing.  I have a Canon Rebel EOS XS, which, don't get me wrong, is a great camera for the high-end amateur. It just doesn't have a built in receiver for a remote wireless shutter release transmitter. It does however have a jack into which you can plug an aftermarket device.  Of course, Canon does not make such a device.  The jack is designed for a wired shutter release.<br /><br />Enter Pixel Pro.  So simple, yet seemingly so elusive for Canon.  You plug the receiver into the jack for the wired shutter release, and you activate it with the companion transmitter in your hand, pocket or wherever you wish.<br /><br />No more setting the self-timer and running to get into the large group picture without mowing down all the others as though they were pins and you were a bowling ball.  Simply casually stroll over to the group, get comfortable, and click the little transmitter.  Voila! Fini!<br /><br />Another nice feature: the transmitter and the receiver have a set of dip switches that you set the same way in each device.  This enables the two units to \"talk\" to one another, but prevents others from triggering your camera or visa versa.<br /><br />One shortcoming though.  The receiver has a threaded mount wheel for the tripod, but unfortunately, in this scenario the camera will be on the tripod. So, you have a few choices:  (1) you can let it dangle, it's light enough so it shouldn't damage the camera jack or the plug. (2) you can use a tad of velcro tape to mount it conveniently on the tripod or the camera within the limits of its short cord.<br /><br />Just make sure your camera has an RS 60-E3 port (jack).  I verified that with Canon before I made the purchase.  You have to be sure, because different models were introduced at different times with different features.  For example, there was an earlier XS that did not have a compatible jack.  Be precise and use the unique model number such as EOS 1000D.<br /><br />Enjoy.  Yes, I'd buy it again.","This is an excellent product. The cable included with the device works perfectly with canon T3i. I have used the wireless transmitter at distances around 50 feet and it has worked every time. The transmitter can be set to single shot mode, continuous shooting mode, bulb mode and 4 seconds delay timer mode.<br /><br />I have particularly found the bulb mode quite useful for long exposures with my Canon T3i. In order to use the bulb mode, both the camera and the transmitter should be on bulb setting. A first press of the button on the transmitter locks the shutter open. Once the desired exposure time is reached, a second press of the button closes the shutter.  There is no need to keep the button pressed during the entire duration of exposure.<br /><br />The 4 seconds delay timer permits sufficient time to hide the transmitter away from view when I want to include myself in the photo.<br /><br />Overall, this device is highly recommended.","Looks like a good product. I've only used this once but I think it is the kind of thing that once you have one, you won't be able to live without it.  My one usage so far, the transmitter/receiver worked every time.  Great way to have the camera do it's job while you can tell the subject \"look over here\".  No wires to trip over is perfect for me.<br /><br />The receiver has a shoe to fit on the flash hotshoe.  This isn't very useful to me as I have a wireless transmitter for a remote flash parked there.  If it had perhaps a pass  through to allow usage of a flash or transmitter, that would be helpful.  However, that is not really a big deal.  the unit is pretty small and I'll probably put a piece of velcro on it and a matching one on the bottom of the camera.  I'm not taking off stars for this as I knew it going in.<br /><br />Not mentioned in the product details that I recall but it does also have a 1/2 press button to allow you to focus without shooting just like you would with the camera button.  This is very useful feature and Amazon should really add that to the product details as I almost didn't buy it because of that.<br /><br />Product looks well built.  The packaging was appropriate and what you would expect for a retail product.","This device is great at what it's advertised to do. The fact that it's wireless makes for ease of movement around and away from the camera. The half-press is easy. There is enough resistance to not accidently trigger a shutter release. Set up was real easy, simply unbox, put batteries in, and plug the receiver into the camera. That's it. The cold shoe allows for placing the receiver on the camera without having it dangle. The only thing I wish this device had was a locking mechanism on the release button. In Bulb mode, you'll have to manually keep the button pressed for however long you want to keep the shutter open. This isn't a big deal if you only want a few seconds. But if you're going to need your shutter open for extended periods (longer than 60 seconds), I'd suggest getting another device.","It works fine and from quite far away too. Just make sure you take the batteries from the transmitter out orelse they could wear out. Other than that, it is an excellent buy and a very useful accessory for my Canon. Prompt delivery too! Highly recommended.","I got this for my Canon Rebel XS (1000D).  I was concerned whether it would work or not, as I had gone to several stores looking for a wireless remote and couldn't find any on the shelf that would work and read several blogs saying a wireless remote would not work for this camera.  This works perfectly.  All 4 settings work as described and I don't know the total range yet, but it works at a distance of at least 40 feet and through 3 walls of my house. I definitely recommend.","Totally worth the money. The range is so good and easy to use. The only thing that could be better is the battery.","There are more than a few of these kinds of radio remote wireless shutter triggers on Amazon. I can't imagine one being nicer than this at any price. Right out of the box this looks like a fine, quality product. Very professional with a finish that looks like brushed black-coated aluminum, although it's all plastic.<br /><br />There were several key features that came as a welcome surprise (especially at this low price):<br /><br />BOTH transmitter and receiver take normal AAA batteries. (Many units use less-popular watch batteries in one part and AAA's in the other)<br />Receiver has a cold-shoe mount so it doesn't dangle and put strain on the connecting cable.<br />The connecting cable can be replaced if it goes bad or if you want to use with another camera (although uncertain where you get another cable)<br />The receiver flashes a red light every second or two to let you know it's 'on and ready' at the camera.<br />The receiver also gives very bright and visible solid confirmation lights: GREEN for focus (half-press remote), RED for shutter release<br />Receiver doubles as a short, wired cable-release.","I bought one of these about 4 months ago, worked flawlessly, excellent for macro work.<br /><br />Now I am ordering one for my wife, also an avid macro photographer.","This wireless shutter remote easy to use. It's model Pixel 221 (but i dont know why they write model 100)."]}]